export const txt = `


新产品开发与技术创新管理小论文


浅谈我对绩效管理的理解



	 
姓    名：陈之强
学    号：121020930544
导    师：明新国
学    院：机械与动力学院
学科名称：新产品开发与技术创新管理
   


2021年11月


摘 要
企业的工资构成对一个企业的发展影响很大，人才是企业之本，如何留住员工，并且让员工心甘情愿的为企业贡献是企业的一大难题，研发绩效管理是其中一个非常不错的办法，员工为企业工作是有所求，要么是工资，要么是晋升通道，要么是得到其他人的尊重和爱戴。通过绩效管理的方式，合理调动员工的工作积极性。
关键词：任职资格、行为准则、PBC、KPI、KCP、组织绩效、个人绩效



目  录
浅谈我对绩效管理的理解	I
摘 要	II
第一章 绪论	1
1.1 引言	1
1.2 本文研究主要内容	1
第二章 东富龙绩效管理分享	2
2.1 背景介绍	2
2.2 绩效管理实施方式	3
2.3 绩效管理方式评价以及优缺点分析	3
2.4 给自动机械的一些建议	4
2.5 我的理解	5
致   谢	6

第一章 绪论
1.1 引言
研发绩效管理是企业为了提高员工工作效率常用的一种管理方法，好的绩效管理可以起到良好的激励效果，让员工心甘情愿为企业奉献，增加企业收入与影响力。绩效管理的方法是只有在组织绩效成功的基础上才能谈个人绩效，预研人员、产品开发人员和研发职能部门人员的绩效考核指标和方法都有区别，应该通过任职资格、行为准则、PBC、KPI和KCP五种手段分别进行绩效管理和激励。
1.2 本文研究主要内容
本文将介绍东富龙集团科技股份有限公司的自动机械部门的绩效管理方式，再分析其中利弊，然后提出一些绩效管理方法改进建议。
第二章 东富龙绩效管理分享
2.1 背景介绍


东富龙科技集团股份有限公司是一家为客户提供药物生产的整体解决方案，药物类型是注射剂抗生素，包括青霉素、红霉素等各种抗生素药物，东富龙是国内在注射剂药物生产方面的最大的设备供应商，客户涵盖国内80%做注射剂药物的制药企业，包括国药集团、扬子江药业、山东齐鲁药业等，以及部分国外客户，主要是印度客户。因为是提供整体解决方案，所以是与客户签订了项目。
为客户提供的整体解决方案由东富龙的各个部门共同完成，设备包含配液系统、洗瓶机、烘瓶机、灌装机、自动进出料、冻干机、隔离器、轧盖机、灯检机以及包装机。我所在的部门是自动机械部门，我部门的设备的主要功能是将注射剂西林瓶等药物包材在灌装机、冻干机、轧盖机之间进行物理位置的转移。
自动机械部门的业务是为客户定制注射剂药品生产环节的包材自动转移设备，与客户签订项目后，任务一般分解为研发设计、物料采购、设备装配、设备调试、FAT验收（客户到我方现场验收设备）、打包发货、SAT验收，验收成功后，再帮助客户通过GMP认证，且满足客户生产要求，则项目结束。
2.2 绩效管理实施方式
自动机械自2020年10月开始实施绩效管理，针对的对象是机械工程师和电气工程师，考核方式是公司以季度为单位先对部门进行考核，考核项包含设计及时率、设计输出任务量、设计台变更量（设备装配调试过程可能会有整改，整改需要通过KK流程走设计更改单）、呆滞物料消耗（呆滞物料的产生一般是由研发人员下错、多下等造成的退库，退库时间超过6个月仍未被使用则转为呆滞物料），如果部门考核通过，将给部门发3W绩效奖金。部门以月度为单位对员工进行考核，设定一些考核项，考核项主要包含项目设计完成及时率、输出任务量、呆滞物料消耗金额、设计更改单数量等方面，部门领导每月结尾会针对这些考核项对员工进行打分，将分数排名，再划分为ABC三个等级，A等级将获得最高的绩效奖金（2300左右），B等级将获得中等的绩效奖金（1500左右），C等级无绩效奖金。
2.3 绩效管理方式评价以及优缺点分析
自动机械是2020年10月份开始实行的绩效考核，主要背景是公司整体工资水平偏低，人才流失率较大，疫情期间公司的业务量大增，面临着活多人少的尴尬境地。自动机械属于比较利润与利润率均较高的部门，产品的市场竞争对手较少，暂时的地位稳居国内第一，但是因为人才流失较快导致产品升级换代速度较慢。所以公司希望通过绩效考核来提升员工的工作积极性以及提升员工工资来挽留更多的人才。
优点：1、先考核组织绩效，再考核个人绩效。组织作为一个整体，组织绩效的成功代表市场和财务的成功，组织由个人组成，个人的优秀不代表组织优秀，个人能力突出加上好的团队合作才可构成一个好的组织； 2、在选择考核项时，列出了10个考核项，最终选择了最重要的4个考核项进行考核； 3、刚实行绩效考核时，员工的工作积极性确实被调动了起来，员工的平均加班时长也比之前要多上一些，前几个月的研发设计产出相比之前确实有所增长。
缺点；1、因为绩效考核方式有些问题，导致几个月后，情况变得不容乐观，因为绩效考核的结果是绝大多数都能拿到A和B等级，极少数人拿C等级，而A和B等级之间的奖金差距没那么大，所以即使不用付出那么多的精力去工作，依然可以拿到绩效奖金； 2、不同工作类型的员工使用相同指标进行考核。自动机械的机械工程师分为两组，一组做相对简单的常规项目，一组做相对复杂的非标研发项目，但是使用如上指标后，做难度更大的非标研发项目的员工如果与做常规项目的员工投入相同时间和经历进行工作，那么按上述绩效指标，设计完成及时率、输出任务量和设计更改单的指标均低于做常规项目的工程师，所以对做非标研发项目的工程师来说，这个绩效不仅没有起到正面效果，反而给人带来负面情绪。
2.4 给自动机械的一些建议
因为自动机械的绩效管理刚刚起步，所以还存在很多问题，以下我将结合自己所学给自动机械一些在绩效管理方面的一些建议：
公司发展离不开人才的贡献，绩效管理是一种让员工自我意愿付出的最好办法。自动机械的目前考核对象是项目的研发设计人员（包含机械设计和电气设计）。我的建议是对于不同工作类型的员工分开进行考核（主要分为常规项目和研发项目）。做常规项目的员工的低级别人员，主要通过行为准则、任职资格、PBC三方面对其考核，对产品开发的低级别人员设定任职资格，主要对员工能力进行评价，包括工作经历、能力和基本素质以及关键业务活动和必备知识等要素；考核员工的PBC，针对员工在项目设计过程的表现给出评价，检查当月必须完成的一些工作，强调过程、路径；给员工设定行为准则，行为准则是必须去完成的，他们属于产品开发工作，对于行为准则中完不成工作的员工，设定惩罚措施。做研发项目的员工，属于产品开发的高级别人员，主要考核KPI、任职资格、PBC、KCP，对于高级别人员考核关键因素。
绩效考核与工资挂钩，如果员工在工作中表现很好，拿到较高等级的绩效考核奖金后的总工资仍然低于市场价，那很容易造成人才流失现象。自动机械应该根据不同类型工作的员工和不同的考核方面，设定不同的绩效奖金，且较为可观的奖金，给员工的激励更大。需要废除内部排名机制，工作做的好，就可以拿到很好的绩效结果，做的不好，就不会有好的绩效结果。
2.5 我的理解
绩效管理强调组织目标和个人目标的一致性，强调组织和个人同步成长，形成“多赢”局面；绩效管理体现着“以人为本”的思想，在绩效管理的各个环节中都需要管理者和员工的共同参与。绩效考核是激励员工自发工作的主要手段，好的绩效考核方式能正确的激励员工，不好的绩效管理模式，意味着公司不仅额外付出了时间、精力和金钱成本，没还来好的回报。
日后，东富龙的绩效管理可能会渗透到整个公司，每个职位，针对不同职位甚至不同的人设定不同的绩效考核方式会有不同的效果。有些人需要金钱激励，有些人需要感受到被尊重才会被激励。同样的员工，实行正确的绩效管理，将会把员工的工作效率提高到新的台阶，公司发展也会更快、更好。


















致   谢
感谢明老师在课堂上传授我们新产品开发与技术创新管理的知识，其中绩效管理知识更为深刻，希望自己以后能把课堂知识实际运用到企业工作中，对企业以及社会做出贡献。



奥的斯电梯改造业务项目管理




姓 名：严磊   
小 组：2组  
学 号：121020930566
2021年11月

摘要: 本文通过对奥的斯电梯改造业务背景、组织架构、产品战略、市场体系以及研发管理、系统工程、合同处理流程等方面实际案例的研究，着重分析了奥的斯公司在电梯改造业务项目管理上的流程、方法以及工具，旨在探索现代工程管理理论应用于实际企业管理中的实践意义。

关键词:电梯改造 流程 方法 工具

1、背景
与其它机械设备一样，电梯和自动扶梯也会发生老化现象。国家规定电梯的整机寿命是15年，这意味着用户未来必须对设备进行更新改造，才能提高运力或舒适度，降低能源成本或确保设备符合新的标准。
奥的斯电梯公司于1853年在美国创立，168年来，奥的斯电梯始终保持着电梯业界的领先地位，一直致力于研究、开发、制造、安装、维修、保养、更新改造电梯、自动扶梯、自动人行道等运输系统，是全球最大的电梯、扶梯及人行走道的供应商和服务商，其产品占全球市场份额的27%。在2011年，奥的斯电梯公司成立中国改造中心，为全球客户提供电梯改造业务整体方案。奥的斯的专业能力可以将高质量部件与既有建筑系统有效结合，打造出既符合要求、又满足新标准和规定的新一代设备。奥的斯中国改造中心秉承奥的斯总部的管理体系，将现代工程管理的流程、方法、工具应用于项目管理之中。

2、组织结构
      奥的斯中国改造中心初期采取的是职能型组织结构，如下图所示：

         这种组织结构的优点是直线管理，层层负责，责权分明，机制简化，号令统一，便于统一管理，提高了内部专业化程度，协调也相对容易。同时该结构使得决策权掌握在最高层管理者的手中。另外，该组织结构节省成本，减少人事方面的复杂性，而且中、高层有专人负责。然而该结构也存在决策流程长，响应客户速度慢，员工缺乏创造性等等缺点。随着时代的发展，越来越强调以客户为中心，快速响应客户，满足市场需求，公司进行组织结构改革，更改为新的服务型组织架构，如下图所示：









改革以后的倒三角型组织结构，将客户置于最顶层，一线服务团队直接为客户提供服务，高层领导以及研发、质量等部门为一线服务团队提供资源，更能快速响应客户需求，把握市场。

3、产品战略规划

3.1 SWOT矩阵分析模型
运用各种调查研究方法，分析出公司所处的各种环境因素，即外部环境因素和内部能力因素。将调查得出的各种因素根据轻重缓急或者影响程度等排序方式，构建SWOT矩阵。
通过SWOT矩阵分析，公司进行如下战略决策：首先，公司将充分发挥其自身高性能、高质量产品的优势，充分利用IOT物联网系统，提取大数据进行深入的用户分析，把握市场以及产品走向，指导公司战略决策；其次，做好充分的客户满意度调查，改善客户的满意度，同时在公司高性能优势上，宣扬公司的品牌战略，应对同行竞品的威胁；再次，在电梯行业智能化、网联化的背景下，深层次研究用户需求，高效整合；最后，通过产品、管理以及服务上的创新，持续不断的提升客户的满意度。





3.2 顶层战略规划

公司的愿景：继续保持其世界一流的电梯供应商领导地位。
使命：在电梯领域实现客户的交通便利，并依靠锲而不舍的创新保持世界领先级企业。
战略目标：2021年全球销售额突破140亿美金，其中改造业务占25%。
商业模式：以改造产品包为主、服务为辅逐渐转变为以服务为主，改造产品包为辅的运营客户型模式，通过IOT物联网连接检测电梯群，实时地为客户提供故障预警，备件更换，电梯线上维保等服务，打造围绕电梯的服务生态系统。
公司按照产品规划总体架构，制定公司的产品战略规划。企业战略规划制定是一个从公司愿景到经营计划到各产品线的愿景和业务计划，再到产品平台及核心技术的需求，并落实到资源规划以及各种激励机制的配套保证的总体流程。 
公司级平台规划及产品线分类原则：IOT物联网系统、QMS质量系统、售后服务系统、DTO系统、改造包系统；产品线分为高速梯线、钢带common产品线、钢丝绳产品线、货梯产品线、加装梯产品线。
公司将以各系列产品改造包为竞争常规赛道，拓展市场；基于产品改造包为客户提供后续的电梯维保、备品备件更换、故障预警等生态服务，作为公司竞争增值赛道；把大数据、物联网、无接触呼梯、智能派梯、人流视频分析、数字化预测性维保等数智化产品及服务作为公司的创新赛道。
通过如下图所示的波士顿矩阵可以看出：高速梯改造业务是公司的明星产品，世界上大型地标类建筑均用的奥的斯电梯，需要继续投入资源稳定目前的市场份额；而钢带common产品是公司的现金牛，技术以及渠道成熟，占据大量的市场，是公司的主要经济来源；加装梯业务是问题产品，目前尚未打开市场，合同谈判时间久且各地政策也不同，但是市场潜力巨大，国务院连续数年的工作报告均提到要推广加装梯，以解决老旧小区出行问题，所以需要加大投入资源以获取市场；钢丝绳产品是公司痩狗产品，公司首先减少批量，逐步撤退，将剩余资源转向其它产品。
新领域发展计划：公司将在节能减排技术以及智能解困技术方面持续投入资源发展。碳中和是未来的必然趋势，节能减排绿色出行；而智能解困将更快更便捷更安全地为客户服务，能够做到第一时间解救被困人员。

3.3 业务层与支撑层
产品战略规划业务层主要包括：产品线的业务计划、支撑产品线业务计划的客户群规划和区域规划、产品线平台规划、新产品路标规划和技术平台的搭建以及资源配置计划等。
新产品路标规划：










      
公司三年规划：随着疫情的反复，公司在今年将继续加大无接触呼梯方面的投入，对于声控、手势、虚拟按键、蓝牙、APP等无接触呼梯技术更进一步开发，打造更便捷智能的无接触呼梯技术，保障乘客的乘梯安全。对对重系统偏置项目、门系统改造包的开发。接下来的两年公司将继续深挖物联网，全方位搜集电梯运行数据，为客户提供实时服务以及预测性维保服务。开发新一代绿色电梯，自带能源返回系统，响应碳中和以节能减排。开发新一代智能解困系统，电梯自动再平层将乘客安全送出，防止困人事件。
产品战略规划支撑层：资源配置管理改进层。主要解决资源冲突情况下各产出线的资源配置，公司新领域新客户的战略补贴方向，公司资本运作，公司核心人才引进和总体管理改进计划。

4、市场体系与研发管理

4.1市场体系
在奥的斯的企业体系当中，市场部的工作相当于营销里面的“营”，英文“market”  。市场体系着重分析客户的需求，进行产品的规划，培养渠道及客户经理，立足于通过核心产品的设计解决客户的问题，其目的首先是要使产品“好卖”。而销售部相当于营销里面的“销”，英文“sale”。销售体系着重抓住产品的特点以及客户需求，将产品销售出去，作用使立足于将产品“卖好”。二者合称营销体系。营销的目标则由简单的立足于产品的销售变成立足于客户需求并通过核心产品、解决方案和服务满足客户需求，解决客户问题。
奥的斯体系当中，营相当于中场，它是沟通研发与销售的桥梁。市场体系处在最前端，搜集客户对于电梯改造的需求，由此来拉动研发开展工作，做需求拉动；另一方面通过市场策划和样板点的建设，比如：上海东方明珠塔斜行电梯项目，美国帝国大厦电梯改造等等地标性建筑项目，推动销售卖公司的产品，做产品推广，完成推动的职能。
市场管理完成从用户需求收集到需求分析，然后根据竞争和公司总体战略的需要，明确产品的总体策略，是开放新产品还是增加渠道，或提高服务和营销能力。当明确需要开发新改造包时，这时要进行客户群细分，明确该改造包针对哪一类客户群，确定开发什么样的功能、规格及产品卖点。当确定功能及卖点后，确定总的技术特性，根据需求分成基本需求，竞争需求和可有可无的需求，完成大产品开发路标规划，并完成细分客户群的产品开发任务书。






       
市场管理的总体流程中，分为：需求管理，路标规划，产品路标规划流程。产品路标规划流程分为五个阶段，包括：产品策略确定阶段、新产品客户群确定阶段、新产品功能需求确定阶段、新产品技术需求确定阶段、新产品路标规划和任务书形成阶段。
4.2需求管理
需求可以分为外部需求与内部需求。外部需求包括用户的需求，国家地方法律法规以及技术标准；内部需求包括产品经理市场、市场经理、客户经理提出的需求，制造部门提出的可生产需求，质量部提出的可测试需求，售后部门提出的可服务性需求等。
当各种需求收集完后，公司的市场管理人员首先会对信息进行初步分析和筛选，公司高级专家进行分析处理、需求分发；对于价值客户、行业协会领导提出的需求信息以及战略产品、核心技术相关的需求信息可以作为重要信息，走公司绿色通道，优先进行分析探讨。 
根据KANO模型分析，得出客户需求，兴奋需求：IOT物联网系统，实现电梯实况信息采集，实时检测电梯运行状况，实现故障预警以及线上维保等服务。期望需求：华美的轿厢装潢，智能派梯系统，门禁闸机与电梯一体化系统。基本需求：电梯运行更安全更舒适。




APPEALS 打分表如下所示，由此可以看出，优势：公司从1853年成立以来，一直作为电梯行业的引领者，在全球范围内都拥有自己的分公司或者服务部门，在品牌、功能性、易用性、售后服务等方面都占据绝对优势。劣势：价格相对较贵。策略：进一步在公司内实行精益管理、精益设计、精益生产，降低产品以及运营成本。发挥公司的品牌优势，在宣传方面突出展示产品的功能特点。
	权重	迅达	通力	蒂升	日立	奥的斯
价格	20%	8	8	8	8	7
交付速度	5%	6	7	8	6	9
用户界面	5%	9	9	7	5	9
功能/性能	25%	8	7	9	7	9
易用性	10%	8	9	7	7	9
售后服务	15%	9	8	7	7	9
全生命周期成本	5%	6	8	8	6	9
社会品牌	15%	8	8	8	7	9
      

5.研发管理与销售管理
5.1产品货架
      奥的斯产品如下，基础的专业基础要走技术开发流程，形成成熟的技术及部件交付；而领域集成技术要走产品开发流程，形成可交付给客户的产品以及持续改进；系统集成技术走定制开发流程。
5.2 流程中的决策与技术评审        
在开发流程中在每个相应的环节做好决策评审以及技术评审，及时验证以及纠偏。
5.3产品开发流程
产品开发流程有概念阶段、计划阶段、开发阶段、验证阶段、发布阶段。在概念阶段首先要通过市场验证和需求验证，设计产品卖点，找一个最接近的对手产品或自己产品作为标杆，根据卖点改造标杆产品，再做出业务计划书，以此怎么自己的卖点。在项目计划阶段，要中号项目里程碑计划、WBS分解、技术评审、一级二三级计划等。开发验证阶段如图所示；发布阶段，一切都是为了产品能够卖出去取得市场的成功。
生命周期管理：从产品稳定生产到生命终结期间内对产品进行管理，主要交付B类和C类更改和产品终止策略。
5.4销售管理
营销的第一路径便是将老产品老技术卖给老渠道老客户，其次是老渠道新客户，再次是新渠道老客户，最后是新渠道新客户。
6、系统工程
系统工程是一种跨学科方法论，用于处理大型复杂系统所面临的问题。系统工程关注系统开发，同时也考虑系统全生命周期。系统工程是一种需求驱动型工程，通过分析各项要求以确保开发出的系统能满足客户所提出的全部需求。应用系统工程可以减少项目完成时间、降低项目成本。 为了应对日益激烈的市场竞争，奥的斯将公司项目都用系统工程进行分析、管控。下图是奥的斯公司以系统工程的方法，对电梯轿门系统功能结构分解：
















系统工程采用先自上而下后自下而上的方法，在系统工程过程进行时，要执行一个迭代程序。 如下图所示的Vee模型： 
自从引入系统工程以后进行工程管理以后，在管理效果上非常显著：产品从需求管理、设计研发、生产制造以及全生命周期管理上均得到有效提升，产品研发周期缩短25%，产品交付率提升30%，而项目进行中的更改较之前减少20%，成本减少15%。
7、电梯改造项目合同处理流程
1 定义
PA：产品管理员，负责合同订单的接收、登记已经合同Specify资料的发放；
CLC：合同控制部；
IBD：国际业务部；
COD：Contract Order Data，合同订单资料，包括合同订单、布置图、排产信息、非标确认表以及其它附属资料；
PDM：Product  Data Management
SO：Sale  Order
2 过程输入
2.1  来自CLC的合同定单资料以及排产安排；
2.2  来自工程部门发放的产品资料
3 过程输出
3.1  释放生产所需要的合同资料，物料订购需要的BOM
4 工作过程
4.1   订单接收、归档
4.1.1     PA接收由CLC部门发出的电子版的COD，确认合同资料是否清晰完整 
4.1.2     确认合同资料清晰完整后，PA将其归档至指定公共盘中
4.1.3     PA将合同资料归档后，立即发邮件通知系统工程师（主管）
4.2  编制Segment
4.2.1     合同工程师按“Segment创建标准作业” 编制Segment，项目量产合同和样梯合同是没有Segment的。样梯合同转入下面4.3步骤；项目量产合同转入下面4.4步骤
4.3  如果属于样梯合同，由主管工程师提议，交CE经理批准并任命项目工程师和组建团队
4.4  如果属于样梯合同，由项目工程师安排处理项目合同的相关长周期物料
4.5  编制合同处理任务书
4.5.1     合同工程师依据合同订单要求，分三种情况的标准作业处理编制合同处理任务书：
           1）日常合同处理任务书 
           2）样梯后量产合同处理任务书 
              3）样梯合同处理任务书完成编制后提交机械和电气系统工程师（主管）或项目工程师校对审批
4.6  校核合同处理任务书
        机械和电气系统工程师（主管）或项目工程师依据合同订单的要求，校核合同处理任务书；如果合同任务书有错或缺漏项目则驳回修改，修改完成正确后通过审批。如果合同为标准合同，则按“标准合同处理标作业”处理；如果为非标合同，低等级难度非标由部门内部指定工程师或者主管工程师校核；中高等级难度非标由Tag review team校核，最后由系统工程师（主管）进行设计任务分配。
 4.7  分配设计任务
机械和电气系统工程师（主管）依据各位工程师的负荷状态，结合非标复杂程度，分配合同设计任务
4.8  长周期物料设计流程
合同工程师判断如果不属于样梯的合同依据COD 配置，在合同没有释放前提供长周期物料清单，发放给物料部门进行提前订购
 4.9  创建SO
如果属于日常合同或者样梯，合同工程师依据合同要求，创建SO(BOM或者SO)；如果属于项目量产后合同直接进入4.10步骤中使用程序输出BOM或者BOM更改工具
 4.10  合同设计
依据非标处理任务书，针对非标点进行结构和功能上特殊设计处理，出非标图纸和编制合同资料（包含非标图纸、LAYOUT、ODS、电气原理图、电气规格参数表等合同信息）。
 4.11  非标图纸的建号
PDM工程师依据合同工程师提供的新建数据申请，按“非标图号建立标准作业”在系统中建立数据和属性；同时按合同所属产品类型向有关部门继续收集其它的数据信息
 4.12  创建合同SO
如果是标准合同，Data Engineer 按“合同SO建立标准作业 ”；
如果是非标合同，Data Engineer将Specify 工程师提供的加减表或者BOM倒入JDE 系统；运行系统重新计算，生成物料清单，确保物料清单无误后，展开成工作订单
 4.13  激活和完善零非标件号
PDM的数据工程师根据收集到的数据属性，依据“激活和完善零件号数据标准作业”在JDE系统进行输入或更改非标件号属性，确保输入正确无误后件号即激活可用
 4.14  合同SO释放
在非标件号激活完善后，数据工程师立即依据排产要求，确保系统SO正确无误情况下，释放合同订单，进入物料订购。如果属于样梯合同，项目工程师按样梯试制流程处理后续工作。


详细流程如下：


8、质量管理
目前制造企业已逐步实现生产自动化，管理信息化，正在向着制造智能化迈进，需要重视数据价值，懂得数据使用。企业要从质量入手，建立质量数据中心，以此进行全过程质量数据分析，让企业从信息系统中使用数据，挖掘数据的价值。建立“互联网+”的企业大数据平台，是企业通往智能制造的必经之路。
奥的斯公司搭建了自己的QMS系统，用于质量管控，从销售端到设计研发、生产制造、现场安装整个流程实施质量管理，所有的质量信息均可以追溯并且用于分析。现场质量反馈AMT提交系统后，第一时间会流到售后服务部门，质量专员根据具体情况转给相应责任人，责任人第一时间处理，要求1-2工作日必须完成反馈，然后现场人员确认反馈信息，形成闭环管理。



9、结论
我国制造业规模居全球首位，然而在技术上大而不强，在科学管理上也相对落后，随着中国制造2025的发布，企业面临着向网络化、数字化、智能化的转型，将工程管理中的科学管理方法运用到企业实践当中就显得尤为重要。本文通过对奥的斯改造电梯项目管理方式方法的探索，验证了工程管理对于企业的实际指导意义，企业要充分地利用工程管理的方法工具完成数智化转型，从中国制造的红海走向中国创造、中国服务的蓝海！




新产品开发与技术创新管理论文


产品项目中的知识管理




	 
姓    名：李倩
学    号：121020930582
学    院：机械与动力工程学院




   


2021年11月

摘 要
产品开发过程包括高度创造性和知识密集型的任务，涉及地理分布的团队之间的广泛信息交换和沟通。由于产品生命周期中涉及的不同系统之间存在地域和制度上的分离，产品知识共享正成为扩展企业信息系统中的关键问题。
本文综述了产品开发过程中产品知识可追溯性的问题和挑战，利用可追溯性信息加强在开发过程中获得的产品知识的共享和使用。
用一种标准化方法来跟踪和共享产品知识，并确定并正式确定产品开发过程中支持可追溯性的关键结构。描述了可追溯性的潜在作用，首先支持工程变更管理 (ECM) 期间的决策过程，其次支持面向产品的知识共享和交换建模以满足质量要求。

关键词：产品知识，产品知识追溯方法，产品知识可追溯性结构，产品开发流程


目  录
1.	引言	3
2.	产品知识和表示	4
2.1	数据、信息和知识	4
2.2	产品知识表示	4
3.	对产品知识管理的可追溯性	5
4.	总结	7

产品项目中的知识管理
1.引言
当今的工业行业中，工程产品开发正在向更多的知识密集型和协作性方向发展。作为参与产品开发的人员、部门和合作伙伴地理上的分布趋于分散，越来越多要求在设计阶段进行全球合作和外包制造工艺[1]。由于不同系统之间的地理上发生分离，参与产品生命周期，查询和分享产品知识成为企业信息系统中的关键问题。为了避免冗长的产品开发周期，跨分布式和多学科协作设计团队已成为必需品。今天的知识密集型产品开发环境需要一个框架来有效地实现产品知识的捕获、表示、检索和重用。这是产品生命周期管理(PLM)[2]的本质。此外，虽然产品开发周期中的每个流程和操作都能够说明对决策有用的信息，但缺少对产品的整体把控。在这里，我们所说的整体把控是指产品中应该包含哪些知识的概念化。用于每个流程、操作或应用程序的产品局部设计可能会发生冲突、冗余或不一致；产品整体把控的构成可以改进产品生命周期管理。PLM的概念旨在超越单一的产品工程，为企业创建、组织和提供共享平台，传播与产品相关的信息。它扩展了产品数据管理(PDM)功能，包括产品信息的创建以及管理和控制此类信息。
目前，在PLM应用程序的共享信息内容缺乏明确的语义是一个主要问题[3]。在产品生命周期应用程序之间使数据语义明确、上下文感知和可共享是一个主要挑战。对于适应性强的组织而言，支持用户之间有明确定义的信息和知识交换过程的产品知识表达一致性至关重要。事实上，促进产品知识交流以来支持协作产品开发常见的共性问题之一是所涉及的参与者没有关于应该共享什么样的知识元素以及应该如何构建沟通的足够指导。可追溯性，定义为描述和跟踪概念或物理工件生命周期的能力，通过为知识共享提供语义和结构指导来解决这些挑战[4]。基于这样一个前提，即实现产品知识共享的一个重要步骤是提供产品开发阶段（即设计和制造）中使用的各种产品知识元素的可追溯性。因此，提出一个可追溯性框架，使得该框架支持产品知识在其生命周期的整个产品开发阶段（即产品设计和产品制造）的跟踪和共享是十分必要的。
2.产品知识和表示
2.1数据、信息和知识
随着我们从工业时代进入信息时代，知识对竞争力至关重要。然而，为了正确地利用知识，有必要准确地理解其性质。数据、信息、知识三者有时可以互换使用的概念。虽然在它们之间划出清晰的界限并不总是那么容易，但这些概念有一些微妙的区别。在不同的研究领域，许多作者已经为数据、信息和知识[5-7]制定了定义，并由Court[8]在工程设计的背景下进行了广泛的审查。根据 Ameri和Dutta[2]的说法，数据代表了未经组织和未经处理的事实。信息可以被认为是处理过的数据的集合，这使得决策变得更容易。知识是评估和组织的信息，可以有目的地在解决问题的过程中使用。数据和信息比知识更容易存储、描述和操作。
Gielingh [9] 也区分了知识、信息和数据；知识是知识处理器，是执行任务所需要的。知识是概念之间关联的结构。因此，概念是形成知识的基本单位。信息是知识的表达。在这样的表达式中，概念由符号（如词）表示，或者——如果没有足够的符号可用——由符号结构（如句子）表示。符号和排列这些符号的规则是语言的一部分。两个希望交流的知识处理者必须同意并了解一种共同语言。数据是信息的表现形式。数据是物理现实的一部分，形成了数据之间的信息载体。两个知识处理器在数字电子表达的情况下，表现形式通常采用电荷或磁性粒子的方向的形式。
2.2产品知识表示
全球信息和知识需求已被广泛探索，形成了包含IDEF0的多视角建模方法、IDEF3流程建模和统一建模语言 (UML) [10,11]。产品知识[12]被定义为集成清单中描述的基本产品数据结构材料（BOM）并逐步升级整个产品开发周期。从广义上讲，产品知识包含所有产品信息，例如订单信息，设计信息、制造信息和管理信息。研究表明，在一个典型的组织中，只有4%的组织知识以结构化和可重用的格式存在，其余的要么是非结构化的，要么存在于人们的大脑中[13]。
管理产品知识的一个关键问题是提供支持信息/知识共享的框架，因为参与成员之间的信息共享至关重要合作的决定因素。为此，信息和知识建模对于建立理解是必要的复杂的信息和知识关系提供不同渠道之间有效互动的渠道信息和知识对象。
Rezayat 认为，每个产品相关人员都应该将产品设计和制造决策背后的基本原理传达给扩展范围内企业的任何人[14]。随后，他开发了基于知识的产品开发 (KBPD) 系统，作为在正确的时间和正确的时间向正确的人提供正确信息。Rezayat提出使用关键特征的概念来定义人或其代理的通词典，使用可扩展标记语言(XML)作为该词典在网络中发挥作用的支持工具。关于设计原理沟通的问题，产品开发过程中的设计意图交换，国际CAD数据交换标准，包括ISO 10303(STEP)直到最近才发展到传输几何[15]。例如，ISO 10303-108 [16]——参数化和显式几何产品模型的约束——使参数和约束信息的捕获和传输以及二维草图的表示成为可能。它专注于较小的几何约束选择并提供自由形式约束功能。另一方面，ISO 10303-111 [17]——实体形状的过程表示元素——仅提供了构建基于特征的实体模型的操作的表示。
Cochrane提出了一套建模指南，用于改进决策支持系统中制造知识的重复使用。然而，Cochrane 的工作主要集中在知识重用的原则，而不是知识建模和表示。这导致了全球制造的信息和知识的协调决策分为三大类：产品相关信息、制造能力相关信息和知识和与订单相关的信息[18]。相应的信息和知识模型通常称为产品模型 (PM)、制造模型 (MM) 和订单模型 (OM)。首先，产品知识被视为产品信息，添加了有关如何使用或应用它的详细信息。这个知识在整个过程中不断发展和升级产品开发生命周期。第二，为了管理创建的产品知识，需要建模开发过程中处理的信息和知识过程。这将为可追溯性方法奠定基础，支持信息和知识共享。此外，该设计和制造决策背后的基本原理需要追踪。这将提高产品知识的使用在未来的决策过程中。
3.对产品知识管理的可追溯性
根据 Yang 和 Li [19]，最近的研究越来越多专注于知识的表达、获取和管理。知识管理被定义为一个过程，一个组织创造、获取、获取和使用知识以支持和改进其性能 [20,21]。此外，知识可追溯性和管理可被视为任何组织的关键绩效指标。这种观点将判断内部流程的绩效以及公司的创新努力。根据Davenport 和 Prusak [22]，大多数知识管理项目具有以下三个目标之一：(1)使知识可见并展示知识在一个过程中的作用组织，主要是通过图表和超文本工具;(2) 鼓励发展知识密集型文化以及聚合行为，例如知识共享和主动寻求和提供知识；(3)建立一个知识基础设施——不仅是一个技术系统，而且也是给定空间、时间的人之间的联系网络工具并鼓励互动和协作。可追溯性可以在产品中发挥关键的知识管理作用开发。
可追溯性管理系统有不同的用途，如知识和数据管理、标准化和产品退货。根据mohan等人的研究。[23]可追溯性有助于理解软件工件内部和它们之间存在的关系，如需求、设计和软件代码模块。这些关系有助于设计人员确定设计和实现是否以及如何满足需求。此外，可追溯性有助于理解在系统开发过程中做出的设计决策背后的基本原理。
在产品可追溯性的具体情况下，不仅要关注开发过程背后的设计原理，还要关注用于制造产品的零部件和原材料。此外，应保留涉及产品开发周期和交付的所有过程的历史。
目前可用的PDM/PLM系统支持产品开发人员之间的信息交换，特别是在工程生命周期的后期阶段，其特征是更具确定性和众所周知的流程。但是，它们缺乏管理和使用产品知识的基本能力，例如设计知识[3]。
在产品开发阶段的产品知识可追溯性的DM/PLM系统。Brandt提出了一种基于本体的知识管理方法，以支持创造性的、非确定性的设计过程。引入了一个流程数据仓库来捕获和重用产品知识。高[24]描述了一个PDM系统与本体论方法和工具的集成。这种集成旨在提供概念设计的知识管理能力，它只能处理相对少量的实例数据。 Szykman [25] 描述了一个设计存储库，可以存储和检索设计工件知识。它基于可通过 Web 界面访问的专有知识库得以实现。
传统知识可追溯性方法的关键问题，特别是从工业应用的角度来看，它是劳动密集型的，无论是对生产知识-工程专家，还是对那些他们正在寻求获得的知识的人[26].例如，在 [24] 中，需要手动明确地输入知识，关于本体实例和静态规则；经验知识是没有记录。此外，这种方法依赖于一个域，其中与过程工程相比，这些过程得到了很好的定义和更好的理解。另一方面，对 [25] 中提出的设计存储库的所有查询都需要手动开发并编码为特定算法。此设计存储库仅限于存储产品数据和文档。它不提供支持相关工作的记录和管理流程和决策程序。除了这些限制，建议的产品知识表示为知识可追溯性是领域相关的或生命周期阶段相关的。事实上，这些解决方案都没有应用于不同的产品开发阶段，例如设计和制造阶段。
4.总结
以上提出的研究是基于实现产品知识捕获的重要一步，而共享则提供了跨各种产品的可追溯性，可追溯性可以在支持产品知识管理方面发挥关键作用。
产品知识可追溯性方法是通用的，可以在目前使用的PLM系统中实现。事实上，在产品开发过程中跟踪产品知识所需的大部分信息已经存在，它们分散在不同的企业信息系统中。然而，关于产品（生命周期）知识是否可以融合到现有的PLM系统中的问题，要实现这一点，还需要进一步考虑。这些要点包括朝着更丰富的产品数据/信息/知识交换进行研究和标准化，加强到语义上更丰富的、基于本体的产品描述，以及非工程数据的集成。


参 考 文 献
[1] Li WD, Qiu ZM. State-of-the-art technologies and methodologies for collaborative product development systems. International Journal of Production Research 2006;44(13):2525–59.
[2] Ameri F, Dutta D. Product lifecycle management: closing the knowledge loops. Computer-Aided Design & Application 2005;2(5):577–90.
[3] Gerritsen B, Gielingh W, Nowacki H, Anderl R, Dankwort W. Editorial — special issue on current state and future of product data technologies (PDT). Computer-Aided Design 2008;40(7).
[4] Mohan K, Ramesh B. Traceability-based knowledge integration in group decision and negotiation activities. Decision Support Systems 2007;43(3): 968–89.
[5] Benyon D. Information and data modelling. Henley-on-Thames (UK): Alfred Waller Ltd.; 1990.
[6] Devine DJ, Kozlowski SWJ. Domain-specific knowledge and task characteristics in decision making. Organisational Behaviour and Human Decision Processes
1995;64(3):294–306.
[7] Tomiyama T. A design process model that unifies general design theory and empirical findings. ASME Design Engineering 1995;83(2):329–40.
[8] Court AW. Modelling and classification of information for engineering design. Ph.D. thesis. UK: University of Bath; 1995.
[9] Gielingh W. Improving the performance of construction by the acquisition, organization and use of knowledge. Ph.D. thesis. Delft University of Technology; 2005.
[10] Dorador JM, Young RIM. Application of IDEF0, IDEF3, and UML methodologies in the creation of information models. International Journal of Computer Integrated Manufacturing 2000;13(5):430–45.
[11] Kim CH, Weston RH, Hodgson A, Lee KH. The complementary use of IDEF and UML modelling approaches. Computers in Industry 2003;50(1):35–56.
[12] Wu HJ, Huang JL. Automating design requirement acquisition for product knowledge management systems. In: Proceedings of IEEE international conference on systems, man and cybernetics. 2004.
[13] Rasmus D. Collaboration, contents and communities, an update. Giga Information Group Inc.; 2002.
[14] Rezayat M. Knowledge-based product development using XML and KCs. Computer-Aided Design 2000;32(5–6):299–309.
[15] Kim J, Pratt MJ, Iyer RG, Sriram RD. Standardized data exchange of CAD models with design intent. Computer-Aided Design 2008;40(7):760–77.
[16] ISO 10303-108. Industrial automation systems and integration—product data representation and exchange: integrated application resource: parameterization and constraints for explicit geometric product models. Geneva (Switzerland): International Organization for Standardization; 2005.
[17] ISO 10303-111. Industrial automation systems and integration—product data representation and exchange: integrated application resource: elements for the procedural modelling of solid shapes. Geneva (Switzerland): International Organization for Standardization; 2007.
[18] Liu S. Manufacturing information and knowledge models to support global manufacturing co-ordination. Ph.D. thesis. UK: Loughborough University; 2004.
[19] Yang C, Li H. Study on product knowledge management for product development. In: Proceedings of the 7th world congress on intelligent control and automation. 2008.
[20] Nonaka I. Dynamic theory of organizational knowledge creation. Organizational Science 1994;5(1):14–37.
[21] Kwan MM, Balasubramanian P. Process-oriented knowledge management: a case study. Journal of the Operational Research Society 2003;54(2):204–11.
[22] Davenport TH, Prusak L. Working knowledge:howorganizations manage what they know. Boston: Harvard Business School Press; 1998.
[23] Mohan K, Xu P, Cao L, Ramesh B. Improving change management in software development: integrating traceability and software configuration management. Decision Support Systems 2008;45(4):922–36.
[24] Gao JX, Aziz H, Maropoulos PG, Cheung WM. Application of product data management technologies for enterprise integration. International Journal of Computer Integrated Manufacturing 2003;16(7–8):491–500.
[25] Szykman S, Sriram RD, Bochenek C, Racz JW, Senfaute J. Design repositories: engineering design’s new knowledge base. IEEE Intelligent Systems 2000; 15(3):48–55.
[26] McMahon C, Lowe A, Culley S. Knowledge management in engineering design: personalization and codification. Journal of Engineering Design 2004;15(4): 305–25.
从OPUS看产品开发流程
袁杰 工程管理 121020930568

摘 要

产品研发工作是企业耐以生存发展的重要内容。很多企业将产品研发工作简单地理解为新产品的开发，其实不然。产品研发主要涉及四类流程，分别是技术开发流程、平台开发流程、产品开发流程以及定制项目开发流程。产品开发流程只是企业新产品研发的一种流程，但因其又是这四大流程中最核心最关键，直接将“知识”转化成“钱”的过程。
本文通过介绍作者所在公司的产品开发流程，旨在分析该企业的产品开发流程的完整性和合理性，是否遵照概念阶段、计划阶段、开发阶段、验证阶段、发布阶段及生命周期管理阶段这六大阶段及概念决策评审、计划决策评审、发布决策评审、退市决策评审来执行，以此来发现作者所在企业的产品开发流程的利弊。


【关键词】OPUS；产品研发；产品开发流程；


从OPUS看产品开发流程
我公司现行采用的新产品开发流程称之为OPUS，是美国Rubrik公司提供的解决方案，OPUS全称是The Optimized Product Realization Process in US。
OPUS流程的目的是形成大批量生产的新产品开发过程，这些过程以泳道图的形式呈现，泳道图中有详细的工作任务包，以模块化的形式来呈现。整个OPUS流程由需求、概念、设计执行、转移、原型样机、测试与市场以及量产共七个阶段组成，每一个阶段均采用并行工程，在特定的阶段结束后，需要通过不同的“门”来回顾这一阶段的进展情况，每一次“门”的评审中里都有多名职能经理，能否通过“门”决定了这一阶段的工作是否完成。
下面本文就详细介绍下OPUS的全部阶段内容及“门”的评审内容。
一 需求阶段
正式项目从需求阶段开始，客户移交产品理念和简要描述，并制定详细需求。
图1  需求阶段
输入：
产品说明（简短的描述，可能的商业计划）
输出：
产品说明（需求）
流程步骤：
101：确定项目经理、团队和能力，对项目进行分类
102：如有需要，建立指导委员会
103：检查并完成“门”和“门”标准
104：提交产品规范（简要说明和商业计划）
105：涉及国际销售合作伙伴
106：审查规范内容（简要说明）是否充分
107：客户使用参数的定义和文件团队的信息
108：商业计划更新
109a：选择原型样机客户
109b：与客户建立合作关系
110：定义产品概念细节
111：创建产品规范（要求）
112：添加经验数据和需求
113：可行性研究
114：开展竞争分析
124：专利搜索
里程碑节点：
115：项目组织、归档结构、项目计划
116：风险管理
117：审查业务计划
118：审查产品说明（需求）
文档：
119：项目计划
120：商业计划
121：多概念选择说明书
122：审查A门标准并确定相关流程步骤
A门（评审节点）：
完成需求阶段
审查A门标准
目标：发布产品规范的当前状态，以便进一步开发
设立下一个“门”（评审节点）：
“门”（评审节点）演示或“静止门”
个人点评：
这一阶段的活动进行了市场验证和需求调研，形成了多概念选择说明书，设计了产品的卖点（R版本），制定了业务计划书，进行了非常详细且全面的需求分析。
二 概念阶段
说明解决方案，考虑到所有相关部门的利益。
目标：多概念选择说明书中的独特产品定义
-市场导向发展，避免偏差
-定义技术概念
图2  概念阶段
输入：
产品说明（需求）
输出：
产品说明（开发概念）
流程步骤：
201：部门间的商务洽谈
202：定义项目团队的参与者
203：检查并完成“门”和“门”标准
204：构想设计想法
205：综合考虑国际市场，定义设计的难点
206：启动市场进入计划和销售产品概念活动
207：取消旧产品
208：反馈给新产品创意的提供者
209：审查多概念选择
210：定义初步设计
212：与采购关于自制件（机械，电子）交涉
213：如果可行，给原型样机客户预测试做原型机
214：考虑环境因素的影响
215：开发产品概念说明，包括流程
216：和项目成员回顾产品概念
217：确保调试、校准、维护、调整和可维修性
218：确保产品适合现代化和改装
219：第一版的设计草图
220：与采购关于自制件（机械，电子）交涉
227：服务的产品概念
里程碑节点：
221：确认和定义项目计划（进度，里程碑，评审节点，资源，时间，成本，质量保证计划）
222：回顾商业计划
223：开发概念（操作，安全，供应）
文档：
224：市场进入规划书
225：可扩展的产品规范书
226：审查B门标准并确定相关流程步骤
B门（评审节点）：
完成概念阶段
审查B门标准
目标：发布产品规范的当前状态，以便进一步开发
设立下一个“门”（评审节点）：
“门”（评审节点）演示或“静止门”
个人点评：
这一阶段的活动完成了从客户需求、到功能需求、到技术需求的映射，形成了整个系统的规格定义，完成了企业的一级计划、到各模块的二级计划、到更详细的个人三级计划，还和供应商交涉控制了采购风险，详细的分析商业计划决定了企业是否投入大量的资源进行开发。
三 设计执行阶段
目标：
可扩展产品规范中的独特产品定义
产品规范中定义质量和测试特性
发布原型样机（测试版）
-机械/电子：在3D中展示实体模型
-软件：演示、设计概念、用户界面设计或类似设计
图3  设计执行阶段
输入：
产品说明（开发概念）
输出：
原型样机（测试版）
流程步骤：
301：检查项目管理和项目团队组成
302：按团队计划项目，定义关卡标准
303：启动销售文档制作并定义内部沟通（内部产品公告）
304：创建销售文章概述
305：确定市场销售计划和原型机数量
306：创建第一版的生产成本和销售定价表
307：跨区域协调
308：整合原型样机销售渠道
309：开始开发-文档阶段
310：备件概念
311：完善观念，创建设计/软件，确保适用性
312：匹配3D构造
313：选择部件、制造商和供应商
314：创建测试计划/确认测试
315：完整的产品规格（解决方案）
316：专利检索
317：确认生产结构（虚拟组件）
318：审查虚拟样机+产品规范（使用测试版）
319：分解软件开发工作包
320：确保调试、校准、维护和可维修性，制定校准方法、校准维修工具、维修概念
321：优化设计
331：结合市场进入计划启动销售培训计划和服务
332：命名：
全球审查
商标保护（如有需要）
定义名称设计
里程碑节点：
322：协调机械与电子
323：协调软件与电子
324：销售文章概述
325：确认设计
326：选择部件供应商、制造商
327：审查会议、供应商名单，并确认价格，审查商业计划
文档：
328：测试计划/测试规范
329：可扩展产品规范
330：审查B门标准并确定相关流程步骤
333：市场进入计划，销售和服务培训计划 
C门（评审节点）：
完成“设计执行”阶段
审查C门标准
设立下一个“门”（评审节点）：
“门”（评审节点）演示或“静止门”
个人点评：
这一阶段不仅拥有完整的解决方案，而且确保调试、校准、维护和可维修性，制定校准方法、校准维修工具、维修概念，市场的介入使得销售工具包和培训得以同期进行，与供应商的交涉进一步降低采购风险。
四 转移阶段
在零件清单不断增加的基础上，原型样机在交付周期和成本方面变得清晰，原型样机的条款和条件可按时提供。

图4  转移阶段
输入：
原型样机（测试版）
输出：
完成原型样机制造的前提
流程步骤：
401：项目经理和项目团队认真考虑，项目管理和团队组成是否也适用于当前阶段
402：与业务管理部门协调市场进入计划
403：进一步开发销售文档
404：生产准备就绪（零件、ERP、物品列表）
405：根据2D-CAD图纸确认设计零件
406：定义并伴随内部和外部转移
407：准备量产
408：装配工作计划
409：协调测试计划
410：实施质量体系规划
411：建立特定于项目的存储区域
412：开始采购物品
413：准备零件清单
414：确定并传达交付周期
415：启动设备制造
416：创建制造工作计划
417：协调施工部件
里程碑节点：
418：项目团队和所有受影响区域和部门了解原型样机
419：原型样机零件完全委托给物流部
文档：
420：测试规范
个人点评：
从设计、到装配、到测试，以及质量和仓储，为原型样机的制造做好了充分的前提。
五 原型样机阶段
这一阶段的目标是制造原型样机，用于执行测试。
图5  原型样机阶段
输入：
完成原型样机制造的前提
输出： 
原型样机（测试版）
流程步骤：
501：项目经理和项目团队回顾项目
502：协商准备产品信息
503：评估原型样机（测试版）
504：及时提交原型样机零件
505：确认设备制造与生产
506：组装原型样机
507：组件和单个组件的调试
508：系统集成
509：包括测试版的客户
510：描述调整方法、校准方法、开发校准和维修工具原型
511：开始为硬件测试设备创建测试软件
512：确定生产任务
513：根据专有技术转让安装原型样机，安装最新软件（软件）
514：将原型零件转移至标准产品部门
515：原型样机的配置
516：标记为原型样机零件并开始制造任务
517：提供状态反馈
518：与标准产品部门协调
519：创建数控机床程序
520：原型样机零件制造
521：选择接近生产的供应商
522：特殊零件或时间关键零件的打样
524：开发服务产品
525：开发改装和符合现代化的产品
里程碑节点：
523：评估原型样机，包括软件原型
个人点评：
这一阶段主要是为了产出原型样机，从生产、装配、测试、加工设备以及供应商等多个方面来考虑，从而完成样机的制造工作。
六 测试与市场阶段
对接近批量生产的原型样机进行所有必要的测试。
图6  测试与市场阶段
输入：
原型样机（测试版）
输出： 
成功测试的初代样机
流程步骤：
601：检查并完成当前评审节点的标准
602：验证技术数据/功能
603：确定产品的预算和交付时间范围
604：完善市场进入计划并准备行动
605：进一步开发销售文档
606：评估结果，应用技术报告
607：定义报价和分组文本
608：创建初版的产品介绍（文本、照片、数据）
609：产品公告
610：在测试用户测试位置的安装
-测试结果
-评价
-成功故事
611：审查接近批量生产的原型机的评估
612：组件和单个组件的试验
613：系统测试（验证）
614：与制造商讨论测试规范
615：与相关部门讨论风险评估
616：产品测试、应用测试（验证）
617：制定/更新用户手册和维修说明，更准确地提供在线帮助
618：检查调试、校准、调整、维护和维修能力
619：调整方法、校准方法、校准和维修工具（样机）移交服务部门
620：调试位置
621：制定具体的培训计划（内部/外部）
622：变更信息管理（图纸、布局等）
623：接近批量生产的原型的调试和测试
632：维护市场进入计划中的所有服务任务
里程碑节点：
624：系统测试完成
625：测试成功执行
626：是否可能提前发布销售
627：审查商业计划
文档：
628：预售
629：应用技术测试报告
630：测试计划，包括评估和测试规范
631：D门评审的监测文件
633：市场进入计划书
D门（评审节点）：
发布进一步开发的最新状态
软件指示与E门联合执行。
如果有销售提前放行，请填写“销售提前放行”
设立下一个“门”（评审节点）：
“门”（评审节点）演示或“静止门”
个人点评：
确保产品在市场上成功，评审市场及客户需求，评审产品及财务假设；确保产品功能方面的信心；确保制造准备就绪；进行系统功能验证测试。
七 量产阶段
优化原型机为准备量产做准备，通过由此阶段生成的大量文档而进行生产，在所有区域和部门进行新产品销售、制造和调试作的最终准备。

图7  量产阶段
输入：
成功测试的原型样机
输出： 
市场上成熟的产品
流程步骤：
701：检查并完成E门标准，并决定E门是否还在
702：创建产品介绍（文本、照片、数据）
703：在ERP中完成产品信息
704：业务管理和项目管理部门调整市场进入计划的内容，并最终审核
705：翻译材料根据市场进入计划的优先级移交给代理
706：信息市场
707：销售人员培训
708：市场进入规划
709：记录校准和维修工具，并使其可用于国际应用
710：完成开发人员文档，定义负责产品的技术人员
711：生产支持
712：降低生产成本
713：开始产品发布
714：培训服务技术人员并移交全部的文档
715：定义备件包
716：生成不同的版本号
717：开始外部服务培训
718：创建调试、检查清单、校准说明、维修说明
719：完整的测试环境
720：完成生产设备
721：接近批量生产的原型调试/校准/测试
722：交流经验
723：制定测试计划
724：员工培训
725：为所有零件创建或匹配物流参数
726：调整生产文件（如CNC程序）
736：完整的面向服务的产品，包括面向市场的解决方案
737：完整的用于从一开始连续测试的组件批量生产
738：提供市场营销方面的投入
739：完成产品的现代化改造，包括营销理念
里程碑节点：
727：是否保证生产/调试
728：审查服务和校准概念
729：审查业务计划
730：是否批量测试成功
731：文件归档
文档：
732：市场进入计划
733：测试计划
734：存档所有的项目开发文件
735：E门评审的监测文件
E门（评审节点）：
审查E门标准（销售和产品发布）：
硬件E门监测
软件E门监测
确认产品在营销过程中是否伴随EVA
个人点评：
市场营销方面的投入，完善的产品销售工具包以及培训，完整的调试、检查清单、校准说明、维修说明以及完整的测试环境，最后对大批量生产做的决策评审，以营造一个产品大量销售的美好环境。

结论
作者所在公司作为德国全资的子公司，有着非常完善的产品开发流程，这使得公司的新产品在上市后，能持续保证稳定的产品质量，满足客户的需求，且能获得较强的市场竞争力。
不足之处在于缺少面向生命周期阶段的B类和C类更改的流程，可能存在不能及时响应客户定制化需求的M版本的更新迭代需求。

【参考文献】
[1] 明新国，余锋，李淼，工业企业产品创新，北京：机械工业出版社，2016.5
[2] 明新国，孔凡斌，何丽娜，面向客户选项的模块化产品开发，北京：机械工业出版社，2017.3
简析客户需求和产品价值

机动学院2021级 周文超 121020930540


1.0背景 
随着现代社会科学技术和商业模式的快速发展，市场竞争的焦点在不断演变，已经由早期的商品经济，产品经济，服务经济转变为体验经济。体验经济时代的重点是能让客户获得愉悦并愿意花钱购买产品（或服务）。
要达到让客户愿意花钱购买的目的，就必须了解客户需求，并拿出合适的产品去满足客户需求。产品价值是客户购买的原始动机，客户不论购买任何产品，都是他本身就想要购买，而不是我们把他说服的。我们要做的就是在客户有需求的时候，向客户展示出产品价值，获得客户的认可和并让其购买产品。纵然有些时候客户会因一时冲动而买东西，而不是真实需求。例如因双十一特价诱惑而购买一个榨汁机，但实际并不需要，仅使用一两次后就闲置一旁。但绝大多数时候，客户肯定是首先有内部动机和需求，然后发现了产品的价值，最终才决定购买产品。
公司从拥有一个先进的技术到推出一款出色的产品，再到产品能满足客户的需求，让产品对客户产生价值有很长的路要走。出色的产品到为客户产生价值之间最大的鸿沟是客户的需求。因而公司在开发新产品、改善老产品、开发新市场时，必须首先确定产品定位，充分识别目标客户需求。如果产品在市场调研时，未能正确识别客户需求，没有想清楚进入什么市场，为哪些客户解决什么问题，在投入大量资金和时间后发现产品预设定位和实际客户需求差异过大，产品无法被市场接受，公司将会遭受巨大损失。本文将讲述客户需求收集的基本方法，如何让客户正确识别产品价值。

2.0收集需求和分析 
要了解客户需求，就需要先确定客户范围，并进行需求调查。首先，我们来看客户范围的划定。按照传统的分类方式，可以分为当前客户（包括当前感到满意或者不满意的客户）、潜在客户、流失客户、竞争对手的客户等。在现有客户中，要重点关注价值客户、利润客户和战略客户的声音，抓住其主要需求。公司根据选定的客户范围，开始收集客户数据。
常用的客户需求收集方法有：
1）书面问卷调查（包括纸质和电子形式）。
最常用的方法是进行邮件调查。此方法可让受访者自由安排时间完成调查，且比专人访问和电话访问的费用更低，易于形成统计分析。
但它有一个重要缺陷是调查返回率低，能达到30-50%的返回率已经很不错了。为提高效率，降低受访者不配合调查的风险，书面邮件调查必须比较简短，这就牺牲了问题的数量。特别需关注到，邮件调查的回复并不是随机的，相对于无太多感受的客户，特别满意或者特别不满意的客户更倾向于回复调查。为了克服这个问题，公司可以通过电话或者面谈随机抽取的客户，确认邮件调查结果是否存在显著偏差，并实施一定的纠正措施。
2）电话调查。
电话调查可以用来补充或者替代书面调查。与邮件调查相比，电话调查返回率更高，调查更准确。电话调查比书面调查具有更多的灵活性，能够在调查过程中对受访者适当加以引导，以获得较完整的调查数据。
电话调查需注意对调查人员进行适当的培训，使其能够按照一致的方式进行调查，减少调查人员本身因素引起的偏差。
3）专人访问。
专人访问是目前最强有力的信息收集技术之一。它可以迅速识别客户关注点并且为书面和电话调查提供问题框架。访谈前制定访谈计划，并根据不同访谈人制定访谈题纲。访问者和受访者可以在关键领域内深入探讨，研究今后发展趋势形成良好的互动。如果实施了充足数量的专人访问，可以形成高质量的客户研究报告。
专人访问的成本很高，特别是当客户数量众多并且分布范围较广泛时，更会付出高额的时间成本和经济成本。并且专人访问对访问者的素质要求较高，需经过恰当的培训，为了避免人员因素引起的调查偏差，最好是引入第三方的调查人员。
4）焦点小组。
焦点小组是定性的小组讨论，一般设置8-10个受访者，并且受访者需通过一定的方式筛选，例如年龄，性别，职业等。需提前准备好讨论指南，并由主持人对现场进行引导。焦点小组的好处是回答每个问题的成本较低。可以用作书面调查和电话调查的准备工作。
5）用户反馈。
用户反馈是收集用户需求最直观的方法之一。公司在为客户提供售后服务的同时，也是收集用户反馈和需求的重要方式。售后服务部门及时整理客户反馈信息，可以快速了解客户在使用过程中的问题。这虽然不是一种系统的客户调查方式，但对于了解客户需求非常重要。
针对价值客户等关键客户，建议采用专人访谈和焦点小组的模式，这有利于获得客户深层次的需求，通过面对面沟通加深客户的参与度，有利于客户对产品的认可和接受度。对于普通客户，可以采用随机抽样的方式进行问卷调查、电话采访，这更容易控制需求调查的成本和经历，也防止过量的无效数据干扰最终决策。
通过上面的5种方法，已经把客户的基本需求信息收集完。公司市场部，技术部和销售部负责对收集的需求分类，确定关键需求，并将其转化为精确的流程化语言。
在完成客户需求调研后，要特别注意客户阐述的需求进行甄别。例如，需要思考客户需求是否真实？调研时客户通常会提供“假需求”，通常会说出解决方案，而不是真正的需求。比如客户说需要一辆自行车时，“自行车”是消费者自己构思的解决方案，而不是深层次的需求，客户真正的需求是的“上班时从家到公司”。如果此时市场和研发人员按照客户的反馈直接确定产品特性，极有可能偏离客户的真正的需求。当跳出客户“假需求”，触及客户真正的目的时，公司有可能不再研发普通自行车，转而去研究电动自行车，因为这能够让客户更省力、快捷的从家到公司。
另外也需考虑需求和公司发展方向是否匹配，对价值客户的意义，对产品改进的意义。最后，客户需求并不是一成不变的，它是一个动态过程，会受社会发展情况和人文因素的改变而改变。因此，对于价值客户的关键需求，公司需每年或每半年对其进行审核，确认其核心需求。例如，手机网络从2G/3G跨入4G具有划时代意义的，高速的网络体验很好的满足了客户上网需求，客户愿意为网络的升级付出更多的花费。但从4G时代跨入5G，用户的接受度变低，项目推进并不顺畅。因为4G网络的速度已经能充分满足普通消费者的使用需求，客户对5G带来的更高速度并不十分感兴趣，转而对套餐价格和信号的稳定性更加关注。此时更快的网络速度已经不是大部分客户的关键需求。

3.0激发产品价值力
从客户需求到客户购买，这其中需给客户足够的动机。动机越大，客户越能发现产品的价值，促使形成购买行动。按照管理学中心理学家弗鲁姆提出的期望理论，在一项工作中人们收到的激励程度，取决于经其努力后取得的成果的价值（效价）与他对实现目标的可能性的看法（期望值）的乘积，用公式表示为：激励力=效价×期望值。只有在预期的行动会给个人带来既定的成果且该成果对个人具有吸引力时，才会被激励起来去做某些事情。同样，也只有在客户需求强度达到一定阀值，且该商品能够很好的满足客户需求时，客户才会认可商品的价值，并购买此商品。用公式表达为：
产品价值=客户需求强度×商品满足该需求的程度。
根据上述公式，产品价值有两个关键要素组成，即客户需求程度和产品特性对需求的满足度。产品很出色，但是我不需要这个功能，没有缺乏感，不会产生需求，对客户而言产品没有价值；有需要感，但产品不能很好的满足客户的需要，也不会对客户产生价值。
需求程度是目标和现实的差距。购买行为是否发生，最本质是由客户动机触发的。只有当客户动机足够强时，才能触发购买行为。这需要扩大目标和现实的差距，也就是要使需求程度最大化。在我们的日常生活中，生产力非常发达，普通的一般商品属性已经难以有效的激发客户对产品的需求力，公司开始对产品赋能，赋予它独特的联想属性。例如聚餐时可以选择饮料，可乐、果汁、椰汁等琳琅满目，这些饮料没有让客户非买不可的动力。可口可乐公司开始在营销中注入标签，让人默认喝可口可乐就能够获得快乐，和亲朋好友分享快乐，因而很多人在聚会时时常会想起可乐，选择可乐。又比如奢侈品包LV，价格昂贵，品牌溢价非常高。但富人对其趋之若鹜，普通人对其青睐有加。因为LV包被赋予了时尚、品味、身份的象征，已经超出了一般消费品的功能范畴。它通过品牌赋能，使商品获得了附加特征属性，能够激发足够的目标和现实落差，扩大了客户的需求程度，成功让客户产生购买行为。
产品特性是解决需求落差的途径。客户的需求程度被激发的足够大，客户有购买的动力，此时要考虑产品是否能很好的满足客户需求。这就回到前面的客户需求调查分析。成功的客户需求分析能切中要害，能深入了解客户内心，在客户形成需求后，能够立即被公司产品特性所吸引。让客户充分认识到产品的特性，并把它转化为客户的价值，给客户创造价值。例如，比亚迪已通过充分的市场调研和行业发展趋势研究，创造了符合市场的一系列电动汽车产品。客户有一个从家到公司的通勤需求，单程十多公里。在上海车牌很难摇到的情况下，客户就很容易想到电动汽车。比亚迪在电动汽车领域做的非常不错，已经有了较强的品牌效应和良好的汽车产品，客户此时将会很自然联想到比亚迪品牌的电动汽车。在客户心目中，此时的比亚迪电动汽车代表着能在上海上绿牌、充足的续航里、良好的驾驶体验，能够很好的满足通勤需求。

4.0结论
从技术到产品，再到为客户产生价值，这其中是一个连续而复杂的过程。客户需求有时并不是直观的、显性的，公司需进行深度挖掘然后找准产品定位。通过挖掘客户需求程度和用合适的产品特性满足客户需求，让客户获得足够的购买动机，让客户认识到商品的价值，并最终实施购买行为。要关注于关键客户关键需求转化为产品卖点。产品卖点在产品开发时就应设计，以此指导产品开发选择什么样的功能和技术，以区别竞争对手，避免同质化竞争，所以卖点首先是设计出来的，而不仅仅是整理出来的。
总之，公司不仅要根据客户需求生产有价值的产品，还需让客户具有清晰明确的价值认识，产品有价值和客户认识到产品有价值是两回事。可以通过产品价值力的两大关键因素，即需求程度和商品满足该需求的程度来挖掘客户消费动力。只有客户需求动力足够强，并且产品特性能满足客户需求时，客户才能充分认识到产品的价值，才能使客户完成购买行动。 

5.0参考文献和文章
1.《新产品开发和技术创新管理》明新国
2.《价值的力量》刘鹏程
3．《六西格玛管理》第三版，何帧
4.《项目管理知识体系指南》第五版
5.《管理学原理》全林

智能网联汽车产品研发管理的分析与研究
张幸怡 
（上海交通大学，机械与动力工程学院）

摘要：本文从一家传统车企在智能化，网联化，自动化转型过程中，产品研发管理体系的优化过程进行了研究。其研发管理体系经过调整后迅速适用于车联网产品的开发，如智能座舱，自动驾驶等突破性创新产品。基于公司的战略目标，结合研发管理体系的三个方面，即组织模式、流程体系和绩效管理，同时利用计算机软件行业已有实践的精益思想、敏捷开发理论以及全面创新理论和流程再造理论，提出了针对性的目标及其优化措施，总结出一套较为适合此类企业在突破性技术产品领域的研发管理方法，
关键词：智能网联汽车，产品研发管理，敏捷开发理论，创新开发

1.引言
智能网联汽车是指搭载先进的传感器、控制器、执行器等装置，并融合现代通信与网络技术V2X，实现车与X（车、路、人、云等）智能信息交换、共享，具备复杂环境感知、智能决策、协同控制等功能，可以实现安全、高效、舒适、节能行驶，并最终代替人来操作的新一代汽车[1]。当下，智能座舱的自动驾驶系统当前正朝着电子电器架构分布式开发和软件架构服务化的趋势不断变革中，随着功能的提升，其硬件和软件系统的构成将会更加复杂[2]。本文对研发管理体系的定义如图1，即研发管理体系是企业在研发领域中所执行的一整套管理机制，包括研发流程体系、研发组织模式和绩效管理体系三大要素，在对公司的产品研发管理体系进行问题分析和优化方案提出时将从该定义入手。
 

图1 产品研发管理体系的定义

2.传统车企研发管理体系
作为一家百年传统车企，其产品研发管理体系是经过历史发而逐步形成的，故其在转型做智能网联汽车时所采用的研发管理体系受其传统产品的研发管理体系影响较大。公司在传统整车产品开发技术上的研发管理体系颇为成功，但在研发自动驾驶产品上缺乏车载软件细分行业的研发经验，没有搭建完善的研发管理体系，遇到了较多的问题。

2.1汽车行业整车开发流程
汽车行业的产品开发有一套自成一体的系统。如图2所示，以某整车上新车型产品开发管理流程为例，其整个产品从立项规划开始到最后量产开始，共经历 6 个大阶段，总共约 45 个月的周期。主要大阶段有产品规划、概念开发、设计开发、试制试验与认证、生产准备和量试与生产。


图2 公司新车型开发管理流程

各阶段要达到的目标： 
（1）产品规划阶段：主要工作是进行可行性分析和立项研究，调查行业现状，分析现有市场，分析现有客户的潜在需求，并找到可能的机会形成新车型的细分定位，同时分析市场现有的或其他厂商即将发布的竞争车型；然后根据产品定位进行技术分析，确定需要研发哪些新技术和工艺，是否需要新型的材料才能满足需求，确定完成新车型开发项目的基本需求和需要哪些资源，预估完成本项目的总预算、目标成本和项目主进度；提交可行性分析报告到高层进行审核并申请批准项目以进行下一阶段的工作。本阶段以该新产品开发项目通过高层评审委员会审核并启动该项目为结束点。 
（2）概念开发阶段：本阶段需继续完善项目可行性分析和新车型的需求定义和配置，完成车身主体的设计方案如底盘结构、动力总成和该设计方案所需要的主要供应商；车辆造型确定，效果图冻结，启动模拟样车试制；若新车型需要特殊的零部件，需要启动该工作；根据已完成工作重新评估项目主进度，并申请批准新产品开发以开始设计开发。 
（3）设计开发阶段：对产品、制造、物料零部件和销售等各环节进行评审和批准后则可进入设计开发阶段。造型和产品配置确定，完成所有系统和零部件的初步设计，并将所有零部件整合设计到车内空间，同时确定哪些部件需要自主研发，哪些需要供应商提供，通知供应商同步进行其产品设计开发，同时确定模具生产和生产模具所需要的生产线，同时启动工程样车的试制。本阶段结束前整车总布置、性能和功能目标得到批准，系统和零部件设计更新并同步到所有供应商，评审制造可行性，审核主进度。 
（4）试制试验与认证：本阶段根据已经试制出的工程样车进行进行质量和性能评估，确定在试制过程中的工艺可在规模化生产中应用，与此同时供应商应小批量开始生产在设计开发阶段确定的零部件，同时进行生产养车制造。 
（5）生产准备：在本阶段应为生产做最后准备，针对试制阶段的生产样车进行质量和性能评估，通过验收标准后将确定该生产工艺及相关的生产设备和供应商零部件要求，最后批准进行预试生产。 
（6）量试与投产：本阶段将使用已经批准进行量产的工艺、设备、供应商零部件进行预试生产的整车进行质量和性能评估，若通过则可批准所使用的工艺、设备和供应商零部件，最后批准新车型发布。
2.2 汽车行业软件开发过程
为了确保汽车对安全性的考虑以及为了明确责任认定，汽车软件行业普遍采用功能安全标准 ISO26262 中的软件部分（Road vehicles–Functional safety - Part 6）和Automotive SPICE等标准来指导自身的软件开发。该安全标准非常注重双向可追溯性，几乎所有整车厂和绝大部分汽车零配件供应商都参考这两个标准来制定自己的软件研发过程。
从图3的V模型[3]可以看出，在实际软件开发中的过程，是SYS.2系统需求分析和SYS.3系统架构设计两个过程获取输入，从SWE.1软件需求分析开始，然后到SWE.6 软件质量测试结束，软件的输出会交给 SYS.4 系统集成及集成测试和SYS.5系统质量测试进行系统验证，这也是流程的运作顺序，每个上游过程为下游过程提供输入，每个下游过程的运行检验上游过程的产出，这样也同时保证了Automotive SPICE 非常看重的双向可追溯性。V 模型每一个层次又是一一对应的，左边过程的输出是右边过程的输入，右边过程的主要工作是验证左边过程的输出。如SWE.1 的输出是软件需求文档，在下游流程如SWE.2 开始软件架构设计的同时，可以开展右边过程 SWE.6 软件质量测试的测试用例的开发工作，也就是说软件质量测试的主要目标物是软件需求，而不应与软件架构设计或更下游的详细设计甚至设计相关。这样在软件开发阶段每个过程的产出即可被至少两个过程测试和验证，可很大程度保证结果的正确性，保证没有缺陷继续流向下游生产环节甚至是流向市场。

图3 Automotive SPICE的V模型

3.智能网联产品研发管理体系的问题与分析
    以自动驾驶产品开发为例，公司虽然积累了宝贵的汽车行业开发经验，认为产品开发也可以复制其在整车项目搭建流程和使用过的工具，但慢慢随着人员的逐渐增多和项目的推进，越来越多的问题逐渐出现。其表象主要有需求不确定导致团队不知如何着手开始研发工作、工作量估计出入非常大导致工作计划和进度安排几乎完全失效、计划的完成时间节点无法完成计划的任务、测试团队在对应时间节点无法收到测试的交付物处于无事可做的状态但过一段时间又突然来一大批交付物，导致团队不得不连续加班才能完成测试任务等多项问题。
3.1流程体系
（1）需求分析阶段
在做自动驾驶产品时，首先公司的智能网联策略规划部会提供一个工作范围说明书，然后需求工程师会基于用户场景挖掘客户的真实需求，澄清模糊的部分，形成需求文档，因此需求也是非常明确的。当公司刚开始做自动驾驶产品时，对市场的需求和用户场景的发掘并不是非常明确，策略部门都用比较开放的词语来描述需求，对公司的开发团队来说非常难理解，因为工程实现时大多时候都必须写一个确定的数值，而使用一些描述性的词语来撰写需求大大的增加了开发难度。例如某需求描述如下：“在一个良好的天气下，可以识别出一个环岛”，如何定义“良好”，如何定义“环岛”，都没有非常明确的定义。
（2）架构阶段
SAE L4/L5自动驾驶涉及到非常多的领域，全世界也都是处于概念阶段，理论也不成熟。这里主要有两大难题。首先，现在技术不成熟，以业界广泛使用的深度学习来说，通过深度学习，软件可以迅速成熟，数据量越大软件就越准确。但是深度学习也有其缺点，当它面临从未见过也就是学习过的数据时，会无所适从。去年，特斯拉发生的一起车祸，其行驶在高速公路上时，一辆箱式货车侧翻，恰好其车顶面向车辆，电动汽车的自动驾驶系统从未训练过这样的数据让它知道那也是一辆车，只不过是一辆翻倒在地的车，即是一个位于行车路线上的障碍物，因此无法识别，直接撞了上去，造成了一起严重车祸。其次，技术发展太快，这个产业涉及的很多领域又处于不太成熟的阶段，所以有大量的空白区域，因此大量的资金支持着大量的资源投入到研究和工程化上面。例如图像识别需要很强的算力，对汽车上的电力消耗也很严重。电力消耗严重会影响汽车的续航里程，而续航里程又是汽车尤其是电动汽车的一个关键指标。软件算法的提高可以缩减算力消耗，但需要花费很大的精力去做算法的提升。公司花了大量的精力做了算法优化减少了算力消耗后发现，芯片厂商已经针对性的推出专为自动驾驶使用的异构芯片，同样的优化前的算法跑在新的芯片上消耗的算力还没有之前的多，并且成本也大幅下降。 
（3）项目计划 
因为需求的不确定给工作量带来了很大的困难，例如识别道路旁移动物体这个指标，客户可能也觉得在产品初期无法做到 100%，也就只能描述性的在需求里写“能识别大多数移动物体”，但“大多数”里面做到 51%和99%通常是有几个数量级的工作量的区别，做到何种程度才能令客户接受是一个现实但又非常难解决的问题。工作量无法准确估计又带来了项目计划很难制定的问题，相 应的人员、成本、时间表都无法给出，则人力资源的招聘计划无法开展，公司的融资活动和后续的市场推广活动同样也无法安排，其影响并非仅仅是研发管理体系。 
（4）实现阶段 
需求、计划和解决方案的不确定性继续影响下游的实现阶段。没有明确的需求、不知道工作量的大小、模糊的解决方案使得实现阶段不得不做出大量的假设才能继续进行，而很多假设到后来被证明是错误的，因此带来了大量的返工。
（5）测试和验证阶段
验证阶段的目标是通过测试产品的实现和需求之间的差异来判断产品是否合格。而需求通常都是模糊的，实现也都是比较随意且加入了很多实现工程师的猜测，具体产品能否实现需求，能在多大程度上满足需求，实现工程师也无法给出判断，验证测试人员也只能稍作测试，产品功能没有大的问题就根据交付日期和领导指示给出通过的意见。但实际换一个场景就会发现有些功能根本无法运行，或者性能很差，客户满意度持续降低。

4.智能网联产品研发管理体系的改进方案
从第3章的问题分析可以看出，公司的研发管理体系在面临突破性技术研发时出现了多方面水土不服的情况，主要有组织架构、流程体系、协作方式、创新文化和工具几个方面。目前仍处于突破性技术创新的技术研发的早期，还未能形成可量化的产品，所以该管理体系需要尽快支持公司形成样机，并将样机集成到整车系统中去，并从中收集反馈，从中找到该突破性技术在实际应用中的价值。改进方案必须考虑突破性技术研发的特点，即市场不明确、技术不成熟、技术发展快，做出相应的改进。
4.1流程体系的改进建议
根据上述的研发问题进行分析和制定改进目标，认为采用 SCRUM 框架并辅以精益思想作为公司的主要开发流程是比较合适的，为保证一个快速反馈的节奏，选择业界也比较流行的两周作为一个迭代[4]。

图4 优化后的研发流程图

4.2产品需求定义
如图4的优化后研发流程图所示，在产品在定义产品需求阶段，市场部人员是主要责任方。市场部人员负责组织项目经理、关键技术人员和客户一起商讨产品的需求，需求来源主要有：（1）市场部门对当前自动驾驶市场的研究；（2）技术人员学习吸收了目前的技术，认为某些需求到达可以实现的阶段，或者某些需求可以用更好的方法实现；（3）来自客户的反馈；（4）开发团队自身的总结和回顾。上述人员在分析所有上述渠道得到的需求后，将产品需求按照优先级排序，并将高优先级的需求进行适当的细化，这样开发团队可以根据优先级和自身团队的能力在迭代中进行实现。在定义需求时不求非常精准和量化，但明确大的方向和需要合作的事项以及各自的职责。
4.3迭代计划
在迭代计划时，开发团队是主要责任方，负责计划本迭代的工作范围。开发团队和需求管理方将继续探讨需求和团队的迭代实现能力，澄清仍然不太明确的需求，对可能纳入本迭代的需求进行工时估计，然后根据团队在本迭代的可用人力确定哪些需求可以放入本迭代内实现。确定之后的工作被成为“迭代工作”，即本迭代的工作范围。一旦此范围确定，在本迭代将不可更改，以避免相关方过于频繁的更改需求，甚至改了之后又要改回去。
4.4迭代开发和回顾
在迭代开发中，开发团队按照计划的迭代工作进行开发、测试和发布工作。在迭代末尾，新的软件发布包和相关文档、数据等即为迭代成果。在迭代开发进行中，市场部人员也应作为团队一员，负责和团队一起澄清需求，尽量缩短因为需求不清而导致的等待时间，提高工作效率。同时市场部人员还需密切关注产品需求，为下一次迭代计划作为准备。
当迭代结束后，所有团队成员和相关方应一起回顾本迭代完成的工作，是否达到了迭代计划中的要求。如果没有达到，则可能将该未完成工作推回到产品需求库中，作为下一个迭代的备选工作内容。如果已经达到要求，则可以作为合格的发布。同时团队需要总结本迭代的工作，是否有需要改变的流程或工作方法，是否有工具可以提高效率，是否有更好的方法来解决某个问题等。总结的成果可以反馈到产品需求库，作为下一次迭代的备选工作。

5.结语
本文以传统整车公司的智能网联产品研发管理体系优化为研究对象，分析了公司在转型中产品研发过程所遇到的问题。该公司原有的传统研发管理体系的三大部分，即组织结构、流程体系和绩效体系已经不符合突破性技术创新的价值网要求和非线性特点，本文识别出原有研发体系的问题，针对性地利用敏捷理论、精益思想、流程再造和全面创新理论提出了优化方案，构建新的研发体系的思路和方案，希望新研发体系在公司的导入后，智能网联产品能够顺利落地。

6. 参考文献
[1]	江军. 智能网联汽车技术的现状及发展趋势 [J]. 农机使用与维修, 2021, (10): 48-9.
[2]	冯远洋, 孙锐, 王洪艳, et al. 汽车智能座舱发展现状及未来趋势 [J]. 汽车实用技术, 2021,46(17): 201-6.
[3]	刘群喜. V公司产品研发流程的优化设计 [D]; 北京交通大学, 2017.
[4]	张强, 袁文斌. 基于CMMI的软件项目管理研究与实践 [J]. 电子技术与软件工程, 2021, (09): 30-1.


上海交通大学论文



	 
姓    名：	张佳萍
小    组：  第六组
学    号： 121020930630
学    院： 机械动力学院
学科/专业名称：MEM

   


                                    


                                             2021年11月


摘 要
从当今汽车行业的发展趋势来看，新能源汽车市场日渐成熟。而智能车灯系统也是现代系能源轿车的一大特征。在智能灯不仅可以动控制车灯的开关，还可以提高夜间行车的安全性；提高汽车的科技感舒缓驾驶员的疲劳感，放松心情；让车内生活更有仪式感，营造轻松愉悦的氛围
这种技术极大地提高了汽车的驾驶安全性和人性化,是汽车车身电子控制的发展方向。上汽大众公司的委托，为VW316/8CM车型开发这种智能车灯控制系统。重点装车样件已经开发完成，2022年10月份可进入量产状态。本文主要阐述了智能车灯的产品开发流程，帮组管理者在产品开发过程规避各种问题点。

关键词：智能车灯， 新产品开发流程，新能源











目录
摘 要	II
第一章 新产品开发流程	4
1.1 行业背景分析	4
第二章 新产品开发流程概述	5
2.1 智能车灯概念阶段开发	5
2.2.1概念阶段的工作分析	6
2.2 智能车灯的计划阶段	6
2.2.1 智能车灯计划阶段工作分析	6
2.3 智能车灯开发、验证阶段流程	6
2.3.1 智能车灯开发、验证阶段分析	7
2.4 智能车灯发布阶段	7
2.5  生命周期管理阶段	8
2.6  本章小结	8


第一章 新产品开发流程
1.1 行业背景分析
今年以来，新能源汽车销量保持高速增长，10月26日，国务院在《2030年前碳达峰行动方案》中首次提出“到2030年，当年新增新能源、清洁能源动力的交通工具比例达到40%左右”。 在“双碳”驱动和电动智能化技术加速迭代的情况下，中国新能源汽车市场发展将超预期，目前的渗透率已经超过10%。中国基于多能源、多技术路线的发展，预计2022年-2023年有望提前实现新能源汽车销量占比达到20%的规划目标，2025年销量占比会超过30%，2030年超过50%；2030年新能源汽车保有量预计突破8000万辆。




                         






发展新能源汽车，第一是电动化，第二是智能化，现在各个汽车零部件的智能化为新能源汽车的发展提供了有力的保证，例如智能座舱，智能光源，智能芯片及驾驶系统。发展新能源汽车，对国民经济的发展和新技术的应用有至关重要的作用。从国家层面说，汽车产业是国民经济的战略性、支柱性产业，中国是汽车大国，目标是成为汽车强国。




第二章 新产品开发流程概述 
K公司是国内知名汽车零部件企业，随着行业的发展，公司的产品结构已经由单一的氛围灯发展到现在的RGB氛围灯，智能灯，阅读灯，USB，AGS控制器等多品类产品。对于新产品开发，K公司是由市场部把外部收集来的需求给到研发部门，研发部门分析评估以及验证这些需求。通过这些需求分析，评估技术趋势，进行细分市场分析，组合市场分析，制定策略，形成最终要想智能化车灯发展路标。



根据产品路标，可以确定我们的产品开发流程。我们智能车灯在开发过程主要包括：概念阶段，计划阶段，开发阶段，验证阶段，发布阶段以及生命周期管理阶段。
本文主要采用理论与实际相结合的方法，以K公司的智能车灯的产品开发过程为例，运用新产品管理工具，总结其经验和不足，提出对K公司智能车灯的开发流程对策和建议，对K公司有一定的借鉴意义，也对我国汽车零部件行业的产品开发流程提供参考建议。
产品开发流程主要分为六个阶段，四个决策评审点，六个技术评审点。
六个阶段：概念阶段，计划阶段，开发阶段，验证阶段，发布阶段以及生命周期管理阶段。
四个决策评审点：概念决策，计划决策，发布决策，生命周期决策。
六个技术评审点：产品包需求评审，系统规格评审，概要设计评审，详细设计评审，详细设计品神，样机评审，批量评审。

2.1 智能车灯概念阶段开发
 项目经理接受项目任务，组建项目团队。明确工作量和绩效考核标准。召开启动会，进行必要的培训，包括流程和专业技能的培训。
 项目团队进行项目需求验证。项目团队依据初步的市场需求，通过与多个客户的沟通和访谈，开展 市场需求验证工作，进一步完善以及确认客户的真实需求。项目团队通过整理、分析和归纳客户需求，形成客户需求规格说明书。进行概念阶段评审，确保产品目标策略是正确的，为下一步的计划的展开打下基础。

2.2.1概念阶段的工作分析
      市场经理在前期只关注智能车灯的成本，无法兼顾智能车灯的功能，可靠性以及可安装性。并且获取到的产品包并不完整，导致后期在设计的时候要一边跟客户要需求，一边进行设计。造成了智能灯在前期选的芯片不符合后期的客户需求，产品的硬件原理图得重新整理。使得人力成本沟通成本大幅度上升，也对公司的资源造成了浪费。 

2.2 智能车灯的计划阶段
     按照客户的里程碑需求以及内部的人力资源规划，明确各阶段各模块所需要的的资源以及时间。对项目中的任务进行WBS分解，把每一项任务分解到每一个团队成员，并且设置可实现的目标。进行方案（软件，硬件，结构，工艺）可行性评审。确立组织绩效个各个参与成员的个人绩效，签订PCB。

2.2.1 智能车灯计划阶段工作分析
     在计划阶段，技术评审是工作中的重中之重。智能车灯的技术评审主要是确定设计方案，为下一步的设备方案做好准备。如果设计评审没有做好，会造成设计人员工作反复，客户样件的延期，客户抱怨。智能车灯在前期在技术评审的时候，并没有邀请到设备的人员参加，导致产品最终与设备不匹配，无法进行生产，测试。这就要求我们在做设计评审的时候一定要与多方进行确认，并且要有一份检查清单，每个人员都要签字确认。这样我们才能在计划阶段避免由于设计失误而带来的人力物力的损失。

2.3 智能车灯开发、验证阶段流程
    在这一阶段，硬件已经选定好芯片，确定了主要方案。结构根据客户的要求进行智能车灯的外观设计。软件主要是V flow 的模型进行软件开发，如下图。

     


设计完成之后，会对硬件，软件代码，系统进行测试，形成相应的测试报告。样件
完成之后，会按照客户的要求对整个智能车灯进行环境，电性能，以及机械以此来
判断产品是否符合看客户的需求。如果有不符合项，要进行各项分析，问题的解决。
在这一阶段主要完成智能车灯各个模块的详细设计，模块，系统功能验证，系统集成测试，系统功能验证。确保产品的功能满足客户的需求，形成最终的产品规格，为设计做好准备。

2.3.1 智能车灯开发、验证阶段分析
      智能车灯在电器性能验证时，发现手持天线试验无法通过。主要是因为ACC开关在持天线测试的点，刚好会影响试验的结果。这主要是因为在设计的时候充分考虑到客户试验的要求，在技术评审阶段有疏忽。这是一个比较小问题点，确使得目的实验费用增加了十几万，使得整个项目成本都在上升，项目进度也有所延迟。

2.4 智能车灯发布阶段 
    市场经理已经建设好了样板间，制定好了产品宣传策略。为产品的进一步推广奠定了基础。在这一阶段主要为产品的批量生产创造条件，完成产品在产线的MSA分析，CPK计划，证实产品在开发和验证阶段的假设，确保产品在市场上的成功。
      在产品的发布阶段主要的交付物有：经验教训总结，样板间建设，成立LMT, 完成销售培训，产品发布及销售。

2.5  生命周期管理阶段
       产品的更改分为A类、B类和C类，A类更改进入新产品 开发流程。当产品开发进入到发布阶段以后，由于产品的不稳定， 客户验证后会出现一些问题；同时还有一些产品需要 不断的优化，我们还需要不断的持续改进。因此在产品的生命周期过程中，不仅存在产品的维护， 还存在产品的改进，这就是B类和C类更改。产品开发有一个原则就是产品进行B类更改和C类更改 时，不能影响A类更改。
      智能车灯项目在生命周期管理阶段成立生命周期管理团队（LMT），专门 负责产品的B类、C类更改和维护。这样新产品的开发人员就不会受到影响，可以更好地 集中精力开发新产品，进而保证了新产品开发的进度 和质量。

2.6  本章小结
      本文主要介绍了新产品管理流程。通过对概念阶段，计划阶段，开发，验证阶段，发布阶段以及生命周期管理阶段的分析，论述了新产品管理流程中所需要注意的点。新产品开发流程不仅需要研发人员的参与，也需要各个部门的人员参与到其中。产品开发流程解决“如何正确做事”，市场管理流程解 决“如何做正确的事”，市场管理流程是产品开发流程的输入。产品开发成功不仅需要人力资源的支撑，也需要体系和流程的支撑。


参 考 文 献
[1] 明新国/孔凡斌，《面向客户模块化管理》，机械工业出版社，2017年版。


SHANGHAI JIAO TONG UNIVERSITY
课程论文
THESIS OF COURSE
论文题目：对敏捷项目管理的思考
学生姓名: 李舒晗
学生学号: 121020930552
专 业: MEM 工程管理
指导教师: 明新国
学院(系): 机械与动力工程学院
对敏捷项目管理的思考
对敏捷项目管理的思考
摘要
敏捷开发是现在应用最为广泛的软件开发技术，其通过循序渐进、反复迭代等方式，
尽可能早的交付可使用的版本，并且可以快速响应需求变更。在传统的机械行业，传统项目
管理模式已经无法满足定制化需求不断增多、变化不断加快的市场。不少欧洲企业已经引了
入基于软件敏捷开发思维而来的敏捷项目管理模式。笔者通过阅读文献，阐述了对敏捷项目
管理的理解。并例举了某一个德国家族企业在开发大型设备时所采用的敏捷项目管理模式作
为案例，结合笔者个人经验，浅析了其优劣，提出了改进的建议，浅谈了自己对敏捷项目管
理的思考。
关键词：敏捷开发，敏捷项目管理，大型设备开发
对敏捷项目管理的思考
目录
第一章 绪论 ----------------------------------------------------------------------------------------------- 1
1.1 二十一世纪传统机械行业面临的挑战------------------------------------------------------- 1
1.2 敏捷项目管理研究现状-------------------------------------------------------------------------- 2
第二章 某德国家族企业的应用案例 ----------------------------------------------------------------- 3
2.1 引言--------------------------------------------------------------------------------------------------- 3
2.2 A 公司流程------------------------------------------------------------------------------------------ 3
2.2.1 平台产品项目(V 版本研发)流程 ----------------------------------------------------- 3
2.2.2 定制化项目(M 版本研发)流程-------------------------------------------------------- 5
2.2.3 管理工具的应用-------------------------------------------------------------------------- 7
2.3 优劣性分析 ----------------------------------------------------------------------------------------- 7
2.3.1 优势分析 ----------------------------------------------------------------------------------- 7
2.3.2 劣势分析 ----------------------------------------------------------------------------------- 8
2.3.3 改进设想 ----------------------------------------------------------------------------------- 8
第三章 对敏捷项目管理的思考 ----------------------------------------------------------------------- 9
第四章 总结与展望 -------------------------------------------------------------------------------------10
参考文献
对敏捷项目管理的思考
第一章 绪论
1.1 二十一世纪传统机械行业面临的挑战
上世纪六十年代，欧美大型机械企业进入了大规模生产的时代，当时市场需要大量、质
量稳定的产品，因此项目管理这一职能逐渐被企业所重视。在 1969 年美国成立了 PMI 组织，
并推出了 PMBOK (Project Management Body Of Knowledge)这一完整的项目管理体系指南，
使项目管理变得有章可循。
图表 1 PMBOK 的规范项目流程
进入二十一世纪后，信息化进程加速，传统机械行业也开始进入了信息化时代，除了标
注产品外，定制化、个性化的需求不断增加，市场从大规模生产时代的卖方市场逐渐转型为
买方市场，客户更倾向于购买一个完完全全符合自己要求的产品，而不是一个标准的、功能
完备的产品，同时对交付期的要求也越来越高。这就对大型设备制造商提出了挑战，传统的
项目管理模式无法很好的适应这种变化快、需要不断进行产品迭代的需求。因此企业的管理
者们将目光转向了已经在软件开发领域获得成功的敏捷开发。软件开发项目往往会遇到交期
短、需求频繁变更、功能复杂且繁琐的情况，敏捷开发采用“小步快跑”的形式，不断对产
品的版本进行迭代，将大型项目拆解成一个个独立的小项目并单独控制质量，做到保质保量
的交付客户。这些经验被总结并融入行业的规律，不断演变形成了现有的机械企业的敏捷项
目管理模式。目前，不少欧洲大型设备制造集团已经引入了该类型的管理方法。
第1页 共 10 页
对敏捷项目管理的思考
图表 2 敏捷开发流程
1.2 敏捷项目管理研究现状
敏捷项目管理是基于“敏捷”这一概念的基础上，由 Jim Highsmith（2005）提出的一种
项目管理方法。[1]主流观点认为敏捷项目管理分为立项阶段、启动阶段、发布循环阶段、迭
代循环阶段、收尾阶段，在《敏捷项目管理适用性分析》[2]一文中，敏捷项目管理被分为构
思、推测、探索、适应和结束这五个步骤。
图表 3 敏捷项目管理[2]
在《敏捷项目管理的哲学思考》[1]一文中将敏捷项目管理归纳为一种针对复杂的、开
放的非线性系统的管理方法。在《敏捷项目管理及实施方案研究》[3]一文认为敏捷项目管
理的特点为：强适应性、只拥有最低限度的规则和良好的协作沟通环境。并且该文从流
程、组织架构、特点进行梳理，讨论了敏捷项目管理是如何适应变化的。在《敏捷项目管
理提高管理灵活性和适应性的研究》[4]中从管理方法出发，论证了敏捷项目管理相比传统
管理更能适应变化，也论证了敏捷项目管理的可行性，并简要分析了其适用性。
第2页 共 10 页
对敏捷项目管理的思考
第二章 某德国家族企业的应用案例
2.1 引言
在第二章中，笔者通过中国知网搜索文献，针对敏捷项目管理进行了梳理，但是文献内
容有限，没有一个很好的理论或者案例针对传统机械企业进行分析，因此笔者以一家外企作
为案例，浅谈对敏捷项目管理在传统机械行业的应用。
案例来自一家德国家族企业的中国全资子公司工作，该全资子公司（以下简称 A 公司）
完全秉承德国的管理系统和模式。A 公司的主要产品均为大型设备，有产品研发周期长、生
产制造周期长、年产量较低（相对车辆制造业）、单个产品售价高等特点。近几年，由于市
场变化加快，定制化个性化销售额激增，对产品价格的要求也越来越苛刻，作为应对，A 公
司引入了敏捷项目管理模式。A 公司将传统项目管理与 Scrum 的敏捷项目管理方法相结合，
所使用的管理软件为 JIRA，并自主开发了几个 SAP 的 T-code 用于辅助。需要说明的是，A
公司由于是机械设备制造商，其开发流程中的交付并不是交付一个可以使用的产品，而是交
付图纸、方案或者计算结果。
2.2 A 公司流程
2.2.1 平台产品项目(V 版本研发)流程
A 公司的平台产品项目流程如下：第3页 共 10 页
对敏捷项目管理的思考
第4页 共 10 页
图表 4 A 公司 V 版本研发流程
可以看到，A 公司平台产品项目管理模式完全符合敏捷项目管理的流程。项目的探索部
分是基于 Scrum 敏捷开发思想的，需要补充说明其与 Scrum 的不同之处为：
1) A 公司的流程中不存在固定的每日站立会议，仅作为部分非常时期的举措。
对敏捷项目管理的思考
第5页 共 10 页
2) Scrum 允许在每个 Sprint 会议时进行项目需求变更，但是 A 公司的模式中，一旦产品进
入了系列化生产，只有在每年两次的 V 版本会议中允许需求变更。
3) A 公司要求按照优先级进行任务，而 Scrum 在处理优先级上面更灵活，A 公司对优先度
的处理更接近极限开发。
导致 A 公司采用这种模式的原因在于：
1) A 公司的产品是大型机械设备，大型机械设备的单一功能和单一模块都需要较长的开发
时间。例如，A 公司设计某一款产品，其中的重要路径为运动模块的设计，需要经历：
重量估算、齿轮齿条及电机选型、尺寸链计算、细节模型设计、参数校核、出图这些步
骤，每一个步骤花费的时间需要以周来计算。其中参数校核这一步需要用到有限元模拟，
该步骤又可以被拆分为模型网格化、有限元参数设置、计算并分析，每一步骤都需要两
到四周的时间。由于单个任务持续时间较长，此类功能模块在设计过程中不需要进行每
日例会的报告，取而代之的是周会或者直接合并入 Sprint 会议。并且该类模块无法进行
需求变更，因为一旦进行需求变更，所有的步骤都需要重新来过，会严重影响项目进度。
虽然不是所有的功能模块都不能接受需求变更，但是为了管理的一致性，A 公司在开发
平台产品的时候限制了需求变更的灵活性以换取项目的可执行性。
2) 由于大型设备的开发往往会牵一发动全身，虽然模块和模块之间互相独立，但是模块内
部的开发复杂且庞大，因此在进行项目管理的时候，不能简单的变更任务的优先级。为
此，A 公司在确定优先级的时候，会对模块内部进行关键路径排布，确保优先级的正确
性和可执行性。
2.2.2 定制化项目(M 版本研发)流程
A 公司针对客户定制化的订单的开发流程如下：
对敏捷项目管理的思考
图表 5 A 公司 M 版本开发流程
可以看到，A 公司针对定制订单的时候，其探索过程与 Scrum 非常类似。需要说明的
是，A 公司定制化项目开发流程与平台开发流程有所不同的地方在于，定制化开发流程允许
频繁的需求变更以及优先级变更，更接近软件的敏捷开发概念，其原因在于：
1) A 公司的客户群不会像软件领域的客户一样频繁的提出变更需求，并且客户提出的需求
往往是不需要对关键模块进行设计变更的。因此，虽然 A 公司对功能进行变更的时间较
长，但是由于市场规律和客户需求不会进行大刀阔斧的改动，A 公司允许在定制产品开
发流程内一切的客户需求变更。
2) 正因为客户提出的需求不会设计核心模块，开发流程中的灵活性比平台产品要高很多。
第6页 共 10 页
对敏捷项目管理的思考
在针对定制产品开发的时候，A 公司允许进行优先级变更，以更好得满足客户需求。
2.2.3 管理工具的应用
A 公司使用 JIRA 和 SAP 进行敏捷项目管理，针对单一任务的流程如下：
图表 6 A 公司业务流程
2.3 优劣性分析
2.3.1 优势分析
较于 A 公司之前使用的瀑布式开发模式，其优势在于：
1) 传统瀑布式开发，在平台产品进入系列化生产之后，没有明确定义后续的研发流程。每
当市场有新的需求，往往需要重新启动一个新项目，流程长、耗费资源多，并且容易使
得项目没有连贯性。而采用了敏捷项目管理模式后，明确定义了直到该产品退出市场，
每半年进行一次 V 版本升级，用于增加新的功能和优化降本等。
2) 传统瀑布式开发，在针对定制化需求时，需要花很长的时间与客户沟通确认需求，会导
致交付期长。一旦在设计时客户需求变更，往往会使得项目卡住甚至停止。而敏捷项目
管理可以做到一边设计一边变更，缩短了交期，增加了灵活度。
3) 瀑布式开发一旦在项目前期出现方向性的错误，后期较难被发现，被发现后往往需要耗
费大量的资源去挽回。而敏捷项目管理在每一个 Sprint 都会汇总信息反馈给管理层，有
助于及时发现和改进项目
4) 瀑布式开发往往需要固定的人员进行平台项目项目，而采用这种类敏捷的方式和工具，
允许在平台产品研发过程中，将部分工作交给其余空闲的研发人员，在人员调度上灵活
性更高。
第7页 共 10 页
对敏捷项目管理的思考
第8页 共 10 页
2.3.2 劣势分析
同样，这种敏捷项目管理也有缺点：
1) 敏捷项目管理要求大量的信息互通，包括维护敏捷工具和进行 Sprint 会议，由于行业特
性，研发人员往往需要投入一定的工作量自行录入信息，同时其余部门也会收到大量的
信息，不利于日常工作开展。
2) 敏捷项目管理的工作量较大，研发人员难以承担，往往由职业经理人担任项目经理进行
汇总和汇报。这导致项目经理对技术理解不深不全面，不利于机械类产品开发。
3) 敏捷项目管理需要进行大量的任务包拆解工作，往往只能由资深的研发人员进行拆解，
这浪费了这些高技术人员的能力。
2.3.3 改进设想
根据笔者自身经验，提出以下几点设想：
1) 除了项目经理的职能外，需要增设一个辅助项目经理或者技术项目经理的职位，该职位
由一线技术人员担当，职能为汇总项目开发过程中的技术问题和进度并汇报给项目管理
层的技术人员（技术总监或者技术经理往往会属于项目管理层），给管理层提供技术输
入。而项目经理只负责控制项目进度。
2) 减少敏捷项目管理中的文档工作。敏捷项目管理中，文档的目的不仅是为了其他技术管
理人员，也是为了非技术人员理解项目进度。但是给非技术人员解释技术问题需要耗费
较多的时间。因此笔者提议，增加定期的会议用于部门间的沟通，但是 Sprint 会议上仅
由技术人员和项目经理讨论技术问题和进度问题，JIRA 等敏捷管理软件中只维护简单
的供其他技术人员参考的信息，这样可以有效减少工作量，提高效率。
对敏捷项目管理的思考
第三章 对敏捷项目管理的思考
从第一第二章不难看出，“敏捷”的思想主要在于“适应变化”和“注重沟通”，不论是
软件开发还是传统机械行业，都可以应用这种思想。软件行业属于轻工业，不需要复杂的制
造过程，几天就可以进行一次更新。传统机械行业相比之下比较笨重，试制时间长，更新需
要几周甚至几个月的时间。因此传统机械行业将敏捷开发进行了变种，将 Sprint 这个概念用
于交流和监控进度，只迭代流程，不迭代产品，这有利于控制项目进程、修正项目方向、增
加信息传递渠道，但是增加了相关人员的工作量，变相增加了管理成本。传统管理更注重对
任务的全面管控，更注重科学原则，而敏捷项目管理将人本思想落实，提出了“注重沟通”
的策略方针，这也体现了社会整体的进步。
我认为将敏捷思想用于传统行业可以增加传统行业的灵活性，增加团队凝聚力，但是每
个行业都需要针对自己行业的特色修改流程，需要在尝试中不断前进。
第9页 共 10 页
对敏捷项目管理的思考
第四章 总结与展望
本文简单梳理了敏捷项目开发相关研究，介绍了 A 公司的敏捷项目管理模式，并与其
以前使用的瀑布式开发模式进行了优劣分析，结合笔者自身工作经验和课堂所学知识，提出
了增加技术项目经理、减少文档工作的改进建议。最后笔者简述了自身对敏捷思想在传统行
业中的应用的思考，认为传统行业应该取敏捷之精华，不断改善和提升自己。
笔者希望可以将所学的知识用到工作实践中，改善公司的项目管理流程和工作效率。
感谢明老师的谆谆教导。
第10页 共 10 页
对敏捷项目管理的思考
参考文献
[1] 柯闻秀，曲红. 敏捷项目管理的哲学思考. 《科技管理研究》，2009 No.9
[2] 袁荃，余小卉，李松梅. 敏捷项目管理适用性分析. 《商业时代》，2013 年 24 期
[3] 高歌，王天勇，杨晔，苏强. 敏捷项目管理及实施方案研究. 《前沿》
[4] 王娟. 敏捷项目管理提高管理灵活性和适应性的研究. 《中国集体经济》
第1页 共 1 页


新产品开发与技术创新管理论文


知识管理在研发企业
项目管理中的应用研究




	 
姓    名：肖航
学    号：121020930501
学    院：机械与动力工程学院




   

2021年11月


摘 要
通过研究项目管理知识体系，分析研发企业项目管理的特点，探讨了研发企业项目管理与当前建筑项目管理在管理内容、过程和方法上的差异，研发项目管理过程包括强调知识创新和知识管理，讨论了研发项目管理中的知识管理，研究了研发企业项目中的知识管理方法，提出了建立标准化流程和技术文档模板、建立知识管理信息系统、构建知识体系的观点。此外，结合研发企业信息系统的实践，证实了基于知识管理的项目管理系统是一种有效方法的观点。

关键词：管理，知识管理，技术创新，知识整合框架，知识管理系统


目  录
1.	引言	3
2.	项目管理知识体与研发企业项目管理的特点	3
2.1	项目管理知识体系	3
2.2	研发项目管理的特点	3
3.	项目管理中的知识管理	4
3.1	知识管理的基本要素	4
3.2	项目管理中的知识管理	4
4.	研发项目知识管理方法	5
4.1	规范文件和过程记录	5
4.2	建立企业知识管理信息系统	6
5.	基于知识管理的项目管理系统应用实例	6
6.	结论	6

知识管理在研发企业项目管理中的应用研究
1.引言
在航空、电子、设备和软件行业等项目管理型企业中，知识是非常重要的资源。如果企业能够有效地管理和使用知识，将提高项目管理质量，缩短项目运行时间，提高客户满意度[1]。尤其是在当今人员流动频繁、知识创新动态变化的社会环境下，如何管理与项目相关的隐性和显性知识是项目成功的必要前提，而管理这些知识资产则是一项新的、具有挑战性的项目管理过程[2],[3]。
研发企业具有典型的基于项目管理的商业组织模式，产品研发过程是知识工作者利用企业已有的显性知识（企业的各种规范和历史信息等记录信息）的过程。积累和隐含的知识（技能、经验、洞察力和直觉），以开展研究活动并创造新的知识和智力资产[4]。因此，在研发企业项目管理过程中如何进行知识管理也是一个重要的问题。本文根据研发企业知识创新与知识管理关系密切的特点,重点探讨了研发企业项目管理中知识管理的实施方法和手段。
2.项目管理知识体与研发企业项目管理的特点
2.1项目管理知识体系
作为一门新兴学科，项目管理专业组织建立了各自的项目管理知识体系（PMBOK），以指导和推动项目管理的应用和发展。目前影响最大的PMBOK是美国项目管理协会（PMI）发布的PMBOK指南和国际项目管理协会（IPMA）的PMBOK标准——国际项目管理职业资格标准[5]。这些知识体系的建立和发布，将对促进项目管理专业发展、提高项目管理人员水平起到积极作用。然而，项目管理的知识体系实际上只包括项目一般管理的知识，并不包括与项目相关的应用领域的知识内容。根据我们对研发项目管理特点和管理要素的分析，不难发现PMI和IPMI实施的项目管理知识主体存在一定的差异。
2.2研发项目管理的特点
目前，大型企业的航天、航空、电子、装备研究所和研究中心都属于研发项目管理模式。研发企业项目管理模式的运行结果不仅是提供高成本的智力产品，而且是创造研究产品和生产知识。研发企业项目的努力一般是智力密集型和资金密集型的多品种小批量、单件和小批量或定制化的离散产品，因为研究产品涉及学科广泛，高度知识汇集、产品创新性强、技术工艺复杂、成本高、经过论证、提案、开发、设计和工程定型、交付和维护保证等典型的产品生命周期管理阶段。因此，研发企业产品的开发过程一般会按照模型（项目）的组织模式进行管理。
3.项目管理中的知识管理
3.1知识管理的基本要素
知识是以文字或语言形式存储的信息资源与经验的整合，是人脑中的思考。知识有隐性知识和显性知识，显性知识可以被信息系统处理，可以编码，也可以编目、存储和保护，隐性知识存在于人们的脑海中，隐性知识难以转移[6]，大部分知识资产（他们的技能、经验、洞察力、直觉以及组织内外的各种关系）存在于知识工作者的脑海中，这部分知识很难评估、共享和衡量。知识管理是有效地识别、获取、发展、分解、储存和转移知识，以改善和提高个人、部门和组织的创新、反应能力、生产力和技能质量。知识管理的价值体现在两个方面：一是通过知识共享提高工作效率；二是通过知识创新创造新价值。知识管理的过程分为知识转化过程和知识循环过程，知识转化过程是明确隐性知识和显性知识之间的关系；知识循环过程是对知识创新和共享两个过程的阐述[7],[8]。
3.2项目管理中的知识管理
从项目管理过程来看，知识管理的范围包括在项目生命周期的时间段内，需要使用和管理的知识也具有丰富的特征，项目的知识管理阶段可分为：
1)项目概念的形成；
2)项目环境分析；
3)目标和范围的确定；
4)详细的项目规划、资源配置、项目审批；
5)项目实施与控制；
6)项目评估与推广[4],[8]。
从跨职能、跨组织的项目管理来看，项目管理中的知识管理可以理解为对知识整合的管理，它包括知识的整合效率、范围和灵活性[6]。知识整合管理本质上是通过管理项目团队来提高项目效益和管理社会关系的过程。在跨职能和跨组织的项目管理知识整合中，项目管理经验、过去的整合经验和组织的社会资本在影响团队合作水平和整合效率、知识范围方面起着重要作用[9]。
从项目管理知识体系来看，按照项目管理知识体系的知识管理框架，它包括知识管理的目标、风险、约束和度量。项目管理中的知识管理主要包括项目运行中的知识识别、获取、开发、分解、使用和存储，其核心是知识共享。在项目团队中，强调知识的交流与共享，提高团队效率，节省项目知识，增强企业的核心竞争力[10]。
4.研发项目知识管理方法
4.1规范文件和过程记录
在项目管理的知识管理过程中，用于传递交流的知识往往是显性知识，项目中标准化的文档和过程记录是知识管理的重要手段，过程记录主要涉及项目实施过程，文档主要涉及项目实施过程。通过文档的呈现和结构来记录知识。相关技术文档不仅要获取标准的业务流程图或项目结果，还要获取项目可行性研究报告、总结、技术报告、设计图片文件、分析报告、用户手册等，以及原因对于失败或者如何有效地解决这些话题也是非常重要的记录。项目操作过程记录包括项目计划、操作、控制、项目变更等，有利于项目综合分析和知识重用。一般来说，知名的知识密集型企业都在采用这种管理方式，例如瑞士银行的“项目案例研究法”——所有的项目报告都有明确的未来项目知识转移目标。这些报告应包括结论和建议等，以总结未来项目中可以改进的内容。
建立各种工艺记录和技术文件模板是一种有效的方法。企业通过不同的项目不断提升核心竞争力，可以根据不同的项目类型建立相应的项目计划模板（包括WBS、团队角色、文档结构等）。在新项目的运作中，企业可以参考模板快速建立项目计划。通过对企业的技术文档进行分析，根据质量体系文档的要求和知识转移的要素，建立企业的文档模板，方便团队使用。
4.2建立企业知识管理信息系统
知识管理信息系统是实现企业知识管理（知识创造、获取、共享和创新）的平台。知识管理系统不是单一的一套应用系统，而是需要根据企业的运行特点与企业应用和IT基础设施进行有机集成，部署实施知识管理功能和管理策略。研发企业业务系统包括产品研发项目管理（PM）、产品数据管理（PDM）、技术条件管理系统（CMS）等系统。从系统功能需求来看，知识管理系统包括：
知识管理的IT基础设施，由知识管理的支撑部分（如数据库、文档库、计算机网络和工作流系统、办公自动化系统、电子邮件系统等）组成；
知识管理的运行框架，包括产品研发项目管理系统、产品数据管理系统、技术条件管理系统和生产过程管理系统等；
知识编辑与处理架构——包括知识获取、创建、共享和检索等功能，这些功能通过企业知识管理门户完成。
5.基于知识管理的项目管理系统应用实例
某企业在内部建立了研发项目管理信息系统。实施中充分考虑了知识集成管理的功能需求。建立项目管理系统，同时部署知识管理功能，包括所有功能模块。通过应用，实现了以项目计划为主线的信息化管理，采用了标准化、规范化的模板技术和流程技术，规范了项目管理流程和技术数据。在项目管理层级、规划人员、研发人员之间建立了有效的沟通平台，提高了管理水平和工作效率。
该系统以项目过程管理为核心，对项目人员、信息、过程和资源进行综合管理。项目管理系统不仅提供了基于网络的协同项目管理和信息交换环境，而且能够规范项目流程和质量文档，集中控制丰富的项目知识，提高业务效率和项目管理质量。
6.结论
知识是企业的重要资源，知识应该得到有效的管理，知识可以通过不同的方式获取和使用，也可以进行编码和记录，从而实现知识的管理。从应用的角度，探讨了研发企业项目管理过程中如何有效管理知识。通过建立、完善和规范项目管理中的各种模板，实现知识的传递和传递。实施项目管理和产品数据管理信息系统，同时建议部署企业知识管理功能，企业知识管理和业务流程管理要有机结合，实现知识共享和知识交流，营造良好的知识共享交流氛围，形成一种企业文化。这些都是帮助企业知识管理提升核心竞争力的有效解决方案。随着知识经济的到来和企业信息化步伐的加快，更多的研发企业将实施知识管理。



参 考 文 献
[1] Love, Peter E.D.; Edum-Fotwe, Francis; Irani, Zahir “Management of knowledge in project environments” [J] International Journal of Project Management 21 (2003) pp.155-156 
[2] Nikos Karacapilidis, Emmanuel Adamides and Christina Evangelou,“A computerized knowledge management system for the manufacturing strategy process” [J] Computers in Industry ,February 2006 , pp.178-188 
[3] Liebowitz, Jay; Megbolugbe, Isaac, “A set of frameworks to aid the project manager in conceptualizing and implementing knowledge management initiatives” [J] International Journal of Project Management 21 (2003) pp. 189-198 
[4] WANG Zhong-tuo,“Knowledge Management in Project Management”,Journal of Wuhan Automotive Polytechnic University Vol. 25 No. 32003.6. ISSN:1007-144X.0.2003-03-001 (in Chinese) 
[5] ThePMI Standards Committee. A Guide to the Project Management Body of Knowledge[Z]. Philadelphia:Project Management Institute , 2000. 
[6] Huang, Jimmy C.; Newell, Sue “Knowledge integration processes and dynamics within the context of cross-functional projects” [J] International Journal of Project Management 21 (2003) pp. 167-176 
[7] Fernie, Scott; Green, Stuart D.; Weller, Stephanie J.; Newcombe, Robert; “Knowledge sharing: context, confusion and controversy” [J] International Journal of Project Management 21 (2003) pp. 177-187 
[8] Shu-Sheng Liaw, Gwo-Dong Chen, Hsiu-Mei Huang; “Users’ attitudes toward Web-based collaborative learning systems for knowledge management”, [J] Computers and Education April 2008 pp 950-961 
[9] Currie, Wendy L. “A knowledge-based risk assessment framework for evaluating web-enabled application outsourcing projects” [J] International Journal of Project Management 21 (2003) pp. 207-217 [10] Kuan Yew Wong and Elaine Aspinwall, “Development of a knowledge management initiative and system: A case study” [J] Expert Systems with Applications May 2006, pp. 633-641 
[11] Nonaka I;Takeuchi H. The Knowledge Creating Company[M] . New York :Oxford University Press ,1995. 
[12] Jean-paul A.barthes,Cesar A.Tacla; “Agent-supported portals and knowledge management in complex R&D projects”. [J]Computer in industry 48(2002) pp3-16. 
[13] Schindler,Martin; Eppler,Martin J. “Harvesting project knowledge: a review of project learning methods and success factors” [J] International Journal of Project Management 21 (2003) pp. 219-228 [14] Chua, Alton, “Knowledge management system architecture: a bridge between KM consultants and technologists” [J] International Journal of Information Management 24( 2004),pp. 87-98 [15] Ho, Cheng-Ter; Chen, Yuh-Min; Chen, Yuh-Jen; Wang, Chin-Bin;” Developing a distributed knowledge model for knowledge management in collaborative development and implementation of an enterprise system” [J]Robotics and Computer-Integrated Manufacturing, October, 2004, pp. 439-456


致   谢

通过八周课程的学习，我对新产品的开发流程有了充分了解，通过进行小组案例分享，将所学知识与企业实际案例进行了结合，拓展了自己的视野。感谢明新国老师为我们传授的产品开发知识！


模块化产品开发

一：模块化的背景
随着中国的发展，中国特色社会主义进入新时代，我国社会主要矛盾已经转化为人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾。人们对消费的需求不再仅仅局限于有或者没有，而是越来越多的增加了个性化定制化的需求，模块化的产品开发可以更好的配合个性化，定制化的需求。另外，随着需求的不断增加，产品功能也越来越多，导致产品结构愈发复杂，过于复杂的产品模块会导致系统的复杂性急剧上升，鲁棒性、可维护度急剧下降。因此，在产品开发中进入模块化方法在所难免。

二：模块化关键方法
在《面向客户选项的模块化产品开发》一书中，提出了多个将产品划分模块的方案。我司开发的产品主要为汽车座椅。该产品中存在数十个选配点，同时不同车型也需要有对应的座椅。通常一款高端车型对应的座椅配置可能会有数十款，一款车型平台对应的座椅配置数量更是高达数百种。因此更需要引入模块化的概念以降低开发、生产成本。
共享构件模块化主要要求一个产品模块可以装配在不同的产品中，并发挥其对应的作用。在我们的开发实践中，该类模块多数用于产品的基本组件部分，如电机+减速器分总成，调节装置等。在座椅中，该类产品主要负责座椅的前后上下调节功能。由于电机减速器内部存在大量的齿轮传动结构，对接口的变更往往会导致齿轮组的整体修改，因此该类组件有着稳定的电气、机械接口，不会轻易更改。在产品开发过程中，需要对产品进行修改，从而匹配该类产品。通常在产品开发的前期，会优先布置该类产品，在确定该模块产品位置后进行其他组件的开发。对于生产端，该类模块常常作为独立的工厂或产线进行生产，并供应全球所有总成件生产工厂，从而最大化规模效应。该类产品的生产线自动化水平常常也是公司所有产品中最高的。
互换构件模块化类似共享构件模块化，相较于共享构件，互换构件同样有着类似的稳定接口，此外，互换构件模块常常为一个产品系列，通过一系列相同或大致相同的接口，实现配置的多样性。例如腰托+按摩系统，对于低配车型，常常没有腰托和按摩，仅仅采用钢丝网作为腰部支撑；对于舒适型配置，可以使用两向手动调节的腰托；对于高配车型，可以使用电动调节的腰托，甚至选配按摩系统。该系列从钢丝网到电动调节+按摩系统均使用的12个孔进行固定。因此产品只要提供对应的12个安装孔，即可支持所有的腰托系统。同共享构件模块的生产方式类似，互换构件模块同样偏向于在特定工厂集中生产。
“量体裁衣”式模块化更多时候适合平台化产品的模块化，如座椅的平台骨架。不同车型平台有不同的座椅安装固定点，不同的座椅造型也要求骨架在合理的位置提供造型支撑，要想将骨架模块化，采用共享构件模式或者互换构件模块未免有些困难，一切的外部接口都在变化，通过“量体裁衣”式模块就可以很好的解决该问题。在设计平台骨架时，更多的着眼于平台的结构而非平台的接口上。座椅骨架的核心在于提供支撑和调节功能，上下调节依靠四连杆机构，前后调节依靠滑轨，靠背调节依靠调角器（滑轨、
调角器均属于共享构件）。因此骨架模块的核心功能在于将以上共享构件通过合适的方式进行连接，并满足安全、耐久的要求。当设计的边界条件发生变化时，骨架的整体结构和工艺方案依然可以复用，仅需要对受边界条件影响的零件进行调整。在不同车型中，也许骨架由于大大小小的修改而各不相同，但它们都具有一致的设计理念，可以使用同一份设计文档和失效模式分析，在发现问题-解决问题的过程也具有足够的相似性。在生产中，该类模块往往不具备很好的规模效应，反而有着递增的边际成本。由于类似零件的过多，在流水线上生产的产品快速切换过程中极容易发生混料，对员工的素质，工厂整体的POKA YOKE流程提出了较高的要求。因此，该类产品更多的使用独立产线或工厂进行一系列产品的生产。
总线模块化往往在整椅生产中使用。整椅作为直接于终端用户交互的产品，也是消费者在配置选择时直接操作的最小单位，往往有着极为复杂的产品配置清单。譬如某车型具有以下选配项：座椅通风、座椅加热、手/电动腰托、织物/皮革/真皮面套、HAPTIC行车偏移提醒、调节记忆功能等，看似选配选项并不多，在将所有需求展开后，共计2 * 2 * 2 * 3 * 2 * 2 = 96种配置，如不能实现模块化，这将会导致产品开发巨大的灾难。整椅作为装配总成，骨架作为总线的结构，其他所有配置构成总线上的一个个构件，在客户完成选配后，通过是否安装或安装不同的共享构件模块来控制产品最后的产出。一方面大幅度降低了产品开发的工作量，另一方面通过生产线的柔性，在同一条产线上生产全部配置的产品。

三：产品模块的接口
一般来说产品的总功能可分解为若干分功能，而各分功能又可以分解为次一级的功能，直到最小的功能模块，产品模块就是指该树状的功能结构图中的各节点。


汽车座椅的模块划分

根据分层抽象的要求，产品模块间的接口应该仅仅局限在同一父节点的子节点内，因此在设计某一产品模块中，我们只需要考虑同级间的模块接口。
如采用自顶向下的设计方案，在设计座椅过程中，我们需要考虑支撑模块，电气模块和舒适模块间的接口。支撑模块和电气模块间需要考虑安装固定点、电气连接方式、控制方式，舒适模块和电气模块间需要考虑电气连接方式和控制方式，而支撑模块和舒适模块间需要考虑安装固定点。
在完成当前层级的接口定义后，若该节点存在子节点（非叶节点），则需要将该节点的接口要求分配到下层模块。如支撑模块需要将电气模块的安装固定点接口传递到下侧支撑调节模块中，即由下侧支撑调节模块负责实现电气模块的安装固定点接口。同时各模块还需要完成自身本身的需要满足的功能。
通过层层分解需求，核对接口，可以获得各个模块所需要完成的功能清单。采用该方案进行产品开发有以下优势
1）各模块仅仅依赖同级模块的接口，在并行开发或者供应商协同开发中，提前设计完善的接口可以将多个不同开发方开发的产品解耦合，避免多个产品开发方之间互相依赖互相干扰。同时给开发方尽可能大的自主权，其仅需要按照需求完成对应的需求，可以任意选择其内部实现的技术方案。
2）根据功能清单，同时也可以拟定对应模块的DVP（设计验证计划）。在完成各个模块的设计工作后，可以依据此完成产品模块的验证，一方面，分模块验证可以更加高效的定位故障所在，同时避免简单的问题经过整机的放大，成为复杂的系统问题，加大了调试的难度。另一方面，单模块但验证工作对测试设备，测试样品的要求较低，通过单模块验证代替整机验证，可以大大降低产品开发的测试成本。
3）在某一模块发生工程变更时，通过先前定义的接口，可以快速的寻找相关模块，避免模块变更造成不同模块间的不兼容。

四：软件工程中的模块化设计
在模块的拆分上，软件工程也在模块化的要求下同样也提出了不少Best Practices，被Erich Gamma、Richard Helm、Ralph Johnson 和 John Vlissides在1994年总结为24个Design Pattern（设计模式）。在软件开发过程中，可以通过编译器的优化实现零成本或低成本的抽象，同时，软件在开发过程中，变更也较产品开发更为频繁，因此软件工程中模块化的设计理论较机械设计中的发展的更为迅速，可以说模块化就是现代软件工程的基石。从中我们也可以获得不少借鉴。
1）适配器模式（Adapter Pattern）是作为两个不兼容的接口之间的桥梁。这种类型的设计模式属于结构型模式，它结合了两个独立接口的功能。通过一个适配器模块，可以将两个不匹配的接口进行匹配。如欧标和国标的电源转换头就实现了欧标接口和国标接口的匹配。
2）桥接（Bridge）是用于把抽象化与实现化解耦，使得二者可以独立变化。这种类型的设计模式属于结构型模式，它通过提供抽象化和实现化之间的桥接结构，来实现二者的解耦。这种类型的设计类似互换构件模块化，通过相同的接口隐藏内部的实现，使得同样的接口可以匹配不同的模块
3）装饰器模式（Decorator Pattern）允许向一个现有的对象添加新的功能，同时又不改变其结构。这种类型的设计模式属于结构型模式，它是作为现有的类的一个包装。该模式类似总线模块化，在一个固定的基底上通过其他模块的增减，实现功能的增减。
4）外观模式（Facade Pattern）隐藏系统的复杂性，并向客户端提供了一个客户端可以访问系统的接口。这种类型的设计模式属于结构型模式，它向现有的系统添加一个接口，来隐藏系统的复杂性。该方案在产品开发中也经常被使用，特别是对于复杂的子零件，如谐波齿轮减速器，在产品整体设计中，往往只需要根据其性能参数进行设计而无需考虑其内部的实现结构，将其整体作为黑箱进行使用，从而减少对产品开发人员的技术要求，加快开发效率。在将传统产品向模块化的推进中，也可以将某些复杂的组件整体打包为一个改观模式组件。
5）责任链模式（Chain of Responsibility Pattern）为请求创建了一个接收者对象的链。这种模式给予请求的类型，对请求的发送者和接收者进行解耦。责任链模式更多的针对流水线上的模块化设计，每一工位为一个模块，提供一项特定的工艺，并可以自由组装。产品在各工位中流动，每一模块对产品进行处理后传递给下一模块，开发人员可以调整各模块的顺序，增减模块来应对后期的不同变化。

五：总结
综上，可以发现随着产品的复杂化，模块化不管在软件工程还是机械工程中都获得来越来越多的运用，通过对模块化的合理使用，可以有效的解藕不同的产品部件，便于通过并行开发缩短开发的时间；划分标准模块进行批量生产，更好的发挥产品的规模效应；降低后期的维护，更新成本；通过模块的不同组合，提供给客户更多的配置选择，增强产品的竞争力。
但由于产品设计中，模块和模块间的交互，接口都需要额外的成本，随着模块的颗粒度的降低，边际成本将会成O(n2)的速度上升（n个模块间互相的接口匹配），而边际效益仅为O(n)，因此如何合理的控制模块划分的颗粒度显的尤为重要。






`;
